/*----------------------------------------------------------------------------*/
/**
* @file		BiSS_Driver.c
* @brief	BiSSモジュールに関するドライバ関数
* @date		24/07/16
* @details	
* @note		
*/
/*----------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------*/
/*インクルードファイル*/
/*----------------------------------------------------------------------------*/
#include <xc.h>
#include "BoardSupportPackage.h"
#include "init_fix.h"
#include "typedef.h"
#include "biss_driver.h"
/*----------------------------------------------------------------------------*/
/*定数定義*/
/*----------------------------------------------------------------------------*/

/*----------------------------------------------------------------------------*/
/*変数定義*/
/*----------------------------------------------------------------------------*/

/*----------------------------------------------------------------------------*/
/*プロトタイプ宣言*/
/*----------------------------------------------------------------------------*/


/*----------------------------------------------------------------------------*/
/*
* @fn        vdg_BiSS_Set_Register(void)
* @brief     BiSSレジスタの設定をします
* @param
* @return
* @detail     
*/
/*----------------------------------------------------------------------------*/
void vdg_BiSS_Set_Register(void)
{
	/*-----------------------------------------------------------------------*/
	/* B1SCDATA0Lレジスタ */
	/*-----------------------------------------------------------------------*/
		B1SCDATA0L = 0x00000000u;
	/*-----------------------------------------------------------------------*/
	/* B1SCDATA0Hレジスタ */
	/*-----------------------------------------------------------------------*/
		B1SCDATA0H = 0x00000000u;
	/*-----------------------------------------------------------------------*/
	/* B1SCDATA1Lレジスタ */
	/*-----------------------------------------------------------------------*/
		B1SCDATA1L = 0x00000000u;
	/*-----------------------------------------------------------------------*/
	/* B1SCDATA1Hレジスタ */
	/*-----------------------------------------------------------------------*/
		B1SCDATA1H = 0x00000000u;
	/*-----------------------------------------------------------------------*/
	/* B1SCDATA2Lレジスタ */
	/*-----------------------------------------------------------------------*/
		B1SCDATA2L = 0x00000000u;
	/*-----------------------------------------------------------------------*/
	/* B1SCDATA2Hレジスタ */
	/*-----------------------------------------------------------------------*/
		B1SCDATA2H = 0x00000000u;
	/*-----------------------------------------------------------------------*/
	/* B1SCDATA3Lレジスタ */
	/*-----------------------------------------------------------------------*/
		B1SCDATA3L = 0x00000000u;
	/*-----------------------------------------------------------------------*/
	/* B1SCDATA3Hレジスタ */
	/*-----------------------------------------------------------------------*/
		B1SCDATA3H = 0x00000000u;

	/*-----------------------------------------------------------------------*/
	/* B1IDS0レジスタ */
	/*-----------------------------------------------------------------------*/
		B1IDS0 = 0x00000000u;
		#ifdef DEF_BITNAME
			B1IDS0bits.IDS0 = 0u;
		#endif 

	/*-----------------------------------------------------------------------*/
	/* B1RDATA0レジスタ */
	/*-----------------------------------------------------------------------*/
		B1RDATA0 = 0x00000000u;
		#ifdef DEF_BITNAME
			B1RDATA0bits.RDATA0 = 0u;
			B1RDATA0bits.RDATA1 = 0u;
			B1RDATA0bits.RDATA2 = 0u;
			B1RDATA0bits.RDATA3 = 0u;
		#endif 

	/*-----------------------------------------------------------------------*/
	/* B1IDS1レジスタ */
	/*-----------------------------------------------------------------------*/
		B1IDS1 = 0x00000000u;
		#ifdef DEF_BITNAME
			B1IDS1bits.IDS1 = 0u;
		#endif 

	/*-----------------------------------------------------------------------*/
	/* B1RDATA1レジスタ */
	/*-----------------------------------------------------------------------*/
		B1RDATA1 = 0x00000000u;
		#ifdef DEF_BITNAME
			B1RDATA1bits.RDATA4 = 0u;
			B1RDATA1bits.RDATA5 = 0u;
			B1RDATA1bits.RDATA6 = 0u;
			B1RDATA1bits.RDATA7 = 0u;
		#endif 

	/*-----------------------------------------------------------------------*/
	/* B1IDS2レジスタ */
	/*-----------------------------------------------------------------------*/
		B1IDS2 = 0x00000000u;
		#ifdef DEF_BITNAME
			B1IDS2bits.IDS2 = 0u;
		#endif 

	/*-----------------------------------------------------------------------*/
	/* B1RDATA2レジスタ */
	/*-----------------------------------------------------------------------*/
		B1RDATA2 = 0x00000000u;
		#ifdef DEF_BITNAME
			B1RDATA2bits.RDATA8 = 0u;
			B1RDATA2bits.RDATA9 = 0u;
			B1RDATA2bits.RDATA10 = 0u;
			B1RDATA2bits.RDATA11 = 0u;
		#endif 

	/*-----------------------------------------------------------------------*/
	/* B1IDS3レジスタ */
	/*-----------------------------------------------------------------------*/
		B1IDS3 = 0x00000000u;
		#ifdef DEF_BITNAME
			B1IDS3bits.IDS3 = 0u;
		#endif 

	/*-----------------------------------------------------------------------*/
	/* B1RDATA3レジスタ */
	/*-----------------------------------------------------------------------*/
		B1RDATA3 = 0x00000000u;
		#ifdef DEF_BITNAME
			B1RDATA3bits.RDATA12 = 0u;
			B1RDATA3bits.RDATA13 = 0u;
			B1RDATA3bits.RDATA14 = 0u;
			B1RDATA3bits.RDATA15 = 0u;
		#endif 

	/*-----------------------------------------------------------------------*/
	/* B1IDS4レジスタ */
	/*-----------------------------------------------------------------------*/
		B1IDS4 = 0x00000000u;
		#ifdef DEF_BITNAME
			B1IDS4bits.IDS4 = 0u;
		#endif 

	/*-----------------------------------------------------------------------*/
	/* B1RDATA4レジスタ */
	/*-----------------------------------------------------------------------*/
		B1RDATA4 = 0x00000000u;
		#ifdef DEF_BITNAME
			B1RDATA4bits.RDATA16 = 0u;
			B1RDATA4bits.RDATA17 = 0u;
			B1RDATA4bits.RDATA18 = 0u;
			B1RDATA4bits.RDATA19 = 0u;
		#endif 

	/*-----------------------------------------------------------------------*/
	/* B1IDS5レジスタ */
	/*-----------------------------------------------------------------------*/
		B1IDS5 = 0x00000000u;
		#ifdef DEF_BITNAME
			B1IDS5bits.IDS5 = 0u;
		#endif 

	/*-----------------------------------------------------------------------*/
	/* B1RDATA5レジスタ */
	/*-----------------------------------------------------------------------*/
		B1RDATA5 = 0x00000000u;
		#ifdef DEF_BITNAME
			B1RDATA5bits.RDATA20 = 0u;
			B1RDATA5bits.RDATA21 = 0u;
			B1RDATA5bits.RDATA22 = 0u;
			B1RDATA5bits.RDATA23 = 0u;
		#endif 

	/*-----------------------------------------------------------------------*/
	/* B1IDS6レジスタ */
	/*-----------------------------------------------------------------------*/
		B1IDS6 = 0x00000000u;
		#ifdef DEF_BITNAME
			B1IDS6bits.IDS6 = 0u;
		#endif 

	/*-----------------------------------------------------------------------*/
	/* B1RDATA6レジスタ */
	/*-----------------------------------------------------------------------*/
		B1RDATA6 = 0x00000000u;
		#ifdef DEF_BITNAME
			B1RDATA6bits.RDATA24 = 0u;
			B1RDATA6bits.RDATA25 = 0u;
			B1RDATA6bits.RDATA26 = 0u;
			B1RDATA6bits.RDATA27 = 0u;
		#endif 

	/*-----------------------------------------------------------------------*/
	/* B1IDS7レジスタ */
	/*-----------------------------------------------------------------------*/
		B1IDS7 = 0x00000000u;
		#ifdef DEF_BITNAME
			B1IDS7bits.IDS7 = 0u;
		#endif 

	/*-----------------------------------------------------------------------*/
	/* B1RDATA7レジスタ */
	/*-----------------------------------------------------------------------*/
		B1RDATA7 = 0x00000000u;
		#ifdef DEF_BITNAME
			B1RDATA7bits.RDATA28 = 0u;
			B1RDATA7bits.RDATA29 = 0u;
			B1RDATA7bits.RDATA30 = 0u;
			B1RDATA7bits.RDATA31 = 0u;
		#endif 

	/*-----------------------------------------------------------------------*/
	/* B1CLTCON0レジスタ */
	/*-----------------------------------------------------------------------*/
		B1CLTCON0 = 0x00000000u;
		#ifdef DEF_BITNAME
			B1CLTCON0bits.SCDLEN0 = 0u;
			B1CLTCON0bits.SCDEN0 = 0u;
			B1CLTCON0bits.LSTOP0 = 0u;
			B1CLTCON0bits.CRCPOLY0 = 0u;
			B1CLTCON0bits.CRCSEL0 = 0u;
			B1CLTCON0bits.CRCSEED0 = 0u;
			B1CLTCON0bits.GRAY0 = 0u;
			B1CLTCON0bits.CRCLEN0 = 0u;
		#endif 

	/*-----------------------------------------------------------------------*/
	/* B1CLTCON1レジスタ */
	/*-----------------------------------------------------------------------*/
		B1CLTCON1 = 0x00000000u;
		#ifdef DEF_BITNAME
			B1CLTCON1bits.SCDLEN1 = 0u;
			B1CLTCON1bits.SCDEN1 = 0u;
			B1CLTCON1bits.LSTOP1 = 0u;
			B1CLTCON1bits.CRCPOLY1 = 0u;
			B1CLTCON1bits.CRCSEL1 = 0u;
			B1CLTCON1bits.CRCSEED1 = 0u;
			B1CLTCON1bits.GRAY1 = 0u;
			B1CLTCON1bits.CRCLEN1 = 0u;
		#endif 

	/*-----------------------------------------------------------------------*/
	/* B1CLTCON2レジスタ */
	/*-----------------------------------------------------------------------*/
		B1CLTCON2 = 0x00000000u;
		#ifdef DEF_BITNAME
			B1CLTCON2bits.SCDLEN2 = 0u;
			B1CLTCON2bits.SCDEN2 = 0u;
			B1CLTCON2bits.LSTOP2 = 0u;
			B1CLTCON2bits.CRCPOLY2 = 0u;
			B1CLTCON2bits.CRCSEL2 = 0u;
			B1CLTCON2bits.CRCSEED2 = 0u;
			B1CLTCON2bits.GRAY2 = 0u;
			B1CLTCON2bits.CRCLEN2 = 0u;
		#endif 

	/*-----------------------------------------------------------------------*/
	/* B1CLTCON3レジスタ */
	/*-----------------------------------------------------------------------*/
		B1CLTCON3 = 0x00000000u;
		#ifdef DEF_BITNAME
			B1CLTCON3bits.SCDLEN3 = 0u;
			B1CLTCON3bits.SCDEN3 = 0u;
			B1CLTCON3bits.LSTOP3 = 0u;
			B1CLTCON3bits.CRCPOLY3 = 0u;
			B1CLTCON3bits.CRCSEL3 = 0u;
			B1CLTCON3bits.CRCSEED3 = 0u;
			B1CLTCON3bits.GRAY3 = 0u;
			B1CLTCON3bits.CRCLEN3 = 0u;
		#endif 

	/*-----------------------------------------------------------------------*/
	/* B1RCCONレジスタ */
	/*-----------------------------------------------------------------------*/
		B1RCCON = 0x00000000u;
		#ifdef DEF_BITNAME
			B1RCCONbits.STRTADDR = 0u;
			B1RCCONbits.WNR = 0u;
			B1RCCONbits.REGNUM = 0u;
		#endif 

	/*-----------------------------------------------------------------------*/
	/* B1CTRLCONレジスタ */
	/*-----------------------------------------------------------------------*/
		B1CTRLCON = 0x00000000u;
		#ifdef DEF_BITNAME
			B1CTRLCONbits.CHSEL = 0u;
			B1CTRLCONbits.HOLDCDM = 0u;
			B1CTRLCONbits.MOEN = 0u;
			B1CTRLCONbits.CLNTID = 0u;
			B1CTRLCONbits.PROTOSEL = 0u;
			B1CTRLCONbits.CTS = 0u;
			B1CTRLCONbits.SFREQ = 0u;
			B1CTRLCONbits.RFREQ = 0u;
			B1CTRLCONbits.BANKSWEN = 0u;
			B1CTRLCONbits.NOCRC = 0u;
			B1CTRLCONbits.IDADIS = 0u;
			B1CTRLCONbits.CMD = 0u;
		#endif 

	/*-----------------------------------------------------------------------*/
	/* B1CCONレジスタ */
	/*-----------------------------------------------------------------------*/
		B1CCON = 0x00000000u;
		#ifdef DEF_BITNAME
			B1CCONbits.FREQAGS = 0u;
			B1CCONbits.MODELAY = 0u;
		#endif 

	/*-----------------------------------------------------------------------*/
	/* B1CHCONレジスタ */
	/*-----------------------------------------------------------------------*/
		B1CHCON = 0x00000000u;
		#ifdef DEF_BITNAME
			B1CHCONbits.CLNTLOC1 = 0u;
			B1CHCONbits.CLNTLOC2 = 0u;
			B1CHCONbits.CLNTLOC3 = 0u;
			B1CHCONbits.CLNTLOC4 = 0u;
			B1CHCONbits.CLNTLOC5 = 0u;
			B1CHCONbits.CLNTLOC6 = 0u;
			B1CHCONbits.CLNTLOC7 = 0u;
			B1CHCONbits.CLCHCFG0 = 0u;
			B1CHCONbits.ACTSEN = 0u;
		#endif 

	/*-----------------------------------------------------------------------*/
	/* B1STATレジスタ */
	/*-----------------------------------------------------------------------*/
		B1STAT = 0x00000000u;
		#ifdef DEF_BITNAME
			B1STATbits.EOT = 0u;
			B1STATbits.REGEND = 0u;
			B1STATbits.REGERR = 0u;
			B1STATbits.SCDTXERR = 0u;
			B1STATbits.DLYERR = 0u;
			B1STATbits.AGSERR = 0u;
			B1STATbits.ERR = 0u;
			B1STATbits.CLSCDV0 = 0u;
			B1STATbits.CLSCDV1 = 0u;
			B1STATbits.CLSCDV2 = 0u;
			B1STATbits.CLSCDV3 = 0u;
			B1STATbits.REGBYTESV = 0u;
			B1STATbits.CDSSEL = 0u;
			B1STATbits.CDMTO = 0u;
		#endif 

	/*-----------------------------------------------------------------------*/
	/* B1INSTRレジスタ */
	/*-----------------------------------------------------------------------*/
		B1INSTR = 0x00000000u;
		#ifdef DEF_BITNAME
			B1INSTRbits.AGS = 0u;
			B1INSTRbits.INSTR = 0u;
			B1INSTRbits.INIT = 0u;
			B1INSTRbits.SWBANK = 0u;
			B1INSTRbits.BNKLOCK = 0u;
			B1INSTRbits.BREAK = 0u;
		#endif 

	/*-----------------------------------------------------------------------*/
	/* B1CHSTATレジスタ */
	/*-----------------------------------------------------------------------*/
		B1CHSTAT = 0x00000000u;
		#ifdef DEF_BITNAME
			B1CHSTATbits.SL0 = 0u;
			B1CHSTATbits.CDS0 = 0u;
			B1CHSTATbits.BKSWERR = 0u;
		#endif 

	/*-----------------------------------------------------------------------*/
	/* B1CONレジスタ */
	/*-----------------------------------------------------------------------*/
		B1CON = 0x00000000u;
		#ifdef DEF_BITNAME
			B1CONbits.CLKSEL = 0u;
			B1CONbits.ACTIVE = 0u;
			B1CONbits.BNKNUM = 0u;
			B1CONbits.REGACC = 0u;
			B1CONbits.GETSENSE = 0u;
			B1CONbits.SENSESEL = 0u;
			B1CONbits.CDS = 0u;
			B1CONbits.CDM = 0u;
			B1CONbits.SIDL = 0u;
			B1CONbits.SLPEN = 0u;
			B1CONbits.ON = 0u;
			B1CONbits.CLKDIV = 0u;
			B1CONbits.REGRST = 0u;
			B1CONbits.SCDRST = 0u;
			B1CONbits.TXRDEN = 0u;
			B1CONbits.REGAE = 0u;
			B1CONbits.INSTRWE = 0u;
			B1CONbits.INSTRWA = 0u;
		#endif 
}		

