/*----------------------------------------------------------------------------*/
/**
* @file		ECAN_Driver.c
* @brief	CANモジュールに関するドライバ関数
* @date		24/07/16
* @details	
* @note		
*/
/*----------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------*/
/*インクルードファイル*/
/*----------------------------------------------------------------------------*/
#include <xc.h>
#include "BoardSupportPackage.h"
#include "init_fix.h"
#include "typedef.h"
#if ( PMD_CAN1MD == PMD_MODULE_ENABLE )	
#include "ecan_driver.h"
#include "ecan_user.h"
/*----------------------------------------------------------------------------*/
/*定数定義*/
/*----------------------------------------------------------------------------*/

/*----------------------------------------------------------------------------*/
/*変数定義*/
/*----------------------------------------------------------------------------*/

unsigned int __attribute__((aligned(4)))CanMessageBuffer[ECAN1_MSG_BUFFER_SIZE];
/*----------------------------------------------------------------------------*/
/* CANFD メッセージタイムスタンプ*/
/*----------------------------------------------------------------------------*/
typedef unsigned long CANFD_MSG_TIMESTAMP;
/*----------------------------------------------------------------------------*/
/* CAN 送受信メッセージオブジェクト制御*/
/*----------------------------------------------------------------------------*/
typedef struct _CANFD_TX_MSGOBJ_CTRL 
{
    unsigned DLC:4;
    unsigned IDE:1;
    unsigned RTR:1;
    unsigned BRS:1;
    unsigned FDF:1;
    unsigned ESI:1;
    unsigned SEQ:7;
} CANFD_TX_MSGOBJ_CTRL;

typedef struct _CANFD_RX_MSGOBJ_CTRL 
{
    unsigned DLC:4;
    unsigned IDE:1;
    unsigned RTR:1;
    unsigned BRS:1;
    unsigned FDF:1;
    unsigned ESI:1;
    unsigned unimplemented1:2;
    unsigned FilterHit:5;
} CANFD_RX_MSGOBJ_CTRL;

/*----------------------------------------------------------------------------*/
/* CANFD 送受信メッセージ 共通ID*/
/*----------------------------------------------------------------------------*/
typedef struct _CANFD_MSGOBJ_ID 
{
    unsigned SID:11;
    unsigned long EID:18;
    unsigned SID11:1;
    unsigned unimplemented1:2;
} CANFD_MSGOBJ_ID;

typedef struct _CANFD_TXMSGOBJ_ID 
{
    unsigned Hi;
    unsigned Low;
} CANFD_TXMSGOBJ_ID;
/*----------------------------------------------------------------------------*/
/* CAN送受信メッセージオブジェクト */
/*----------------------------------------------------------------------------*/
typedef union _CANFD_TX_MSGOBJ 
{
    struct 
    {
        CANFD_TXMSGOBJ_ID id;
        CANFD_TX_MSGOBJ_CTRL ctrl;
        CANFD_MSG_TIMESTAMP timeStamp;
    } bF;
    unsigned int word[4];
    unsigned char byte[8];
} CANFD_TX_MSGOBJ;

typedef union _CANFD_RX_MSGOBJ 
{
    struct 
    {
        CANFD_MSGOBJ_ID id;
        CANFD_RX_MSGOBJ_CTRL ctrl;
        CANFD_MSG_TIMESTAMP timeStamp;
    } bF;
    unsigned int word[4];
    unsigned char byte[8];
} CANFD_RX_MSGOBJ;


struct 
{
    _u2 u2_SID;
    _u2 u2_DLC;
    _u2 u2_Data[8];
    CANFD_MSG_TIMESTAMP u4_TimeStamp;
    
    _u2 u2_DataUpDate;
}s_FIFO[ECAN_FIFO_NUM];


/*----------------------------------------------------------------------------*/
/*プロトタイプ宣言*/
/*----------------------------------------------------------------------------*/


/*----------------------------------------------------------------------------*/
/*
* @fn        vdg_ECAN1_Set_Register(void)
* @brief     ECAN1レジスタを初期化します
* @param
* @return
* @detail 
*/
/*----------------------------------------------------------------------------*/
void vdg_ECAN1_Set_Register(void)
{
    /*----------------------------------------------------------------------------*/	
    /* CAN1制御レジスタLow */		
    /*----------------------------------------------------------------------------*/
        C1CONL	= 0x0000u;	
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            C1CONLbits.DNCNT	= 0u;	/* DeviceNetフィルタビット番号ビット */
            C1CONLbits.ISOCRCEN	= 0u;	/* CAN FDフレームISO CRCを有効化ビット */
            C1CONLbits.PXEDIS = 0u;     /* プロトコル例外イベント検出無効ビット */
            C1CONLbits.CLKSEL = 0u;     /* CANモジュールクロック選択ビット */
            C1CONLbits.WAKFIL = 0u;     /* ウェイクアップフィルタ有効化ビット */
            C1CONLbits.WFT	= 0u;       /* スケーラブルウェイクアップフィルタ時間ビット */
            C1CONLbits.BUSY	= 0u;       /* CANモジュールビジービット */
            C1CONLbits.BRSDIS = 0u;     /* ビットレートスイッチング無効化ビット */
            C1CONLbits.SIDL	= 0u;       /* アイドル中停止ビット */
            C1CONLbits.CON	= 0u;       /* モジュール有効化ビット(0 = 無効 / 1 = 有効)  */
#endif /* コード量削減 */
    /*----------------------------------------------------------------------------*/        
    /* CAN1制御レジスタHigh */		
    /*----------------------------------------------------------------------------*/
        C1CONH	= 0x0000u;	
        
        C1CONHbits.REQOP = ECAN1_MODE_CONFIG;
        while(C1CONHbits.OPMOD != ECAN1_MODE_CONFIG);
        
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            C1CONHbits.RTXAT	= 0u;	/* 再送信試行制限ビット */
            C1CONHbits.ESIGM	= 0u;	/* ゲートウェイモードESI送信ビット */
            C1CONHbits.SERRLOM	= 0u;	/* システムエラーでリッスンオンリーモードに移行ビット */
            C1CONHbits.STEF	= 0u;       /* 送信FIFO格納ビット */
            C1CONHbits.TXQEN	= 0u;	/* 送信キュー有効化ビット */
            C1CONHbits.OPMOD	= 0u;	/* 動作モードステータスビット */
            C1CONHbits.REQOP	= 0u;	/* 要求動作モードビット */
            C1CONHbits.ABAT	= 0u;       /* 保留中の全送信中止ビット */
            C1CONHbits.TXBWS	= 0u;	/* 送信帯域幅共有ビット */
#endif /* コード量削減 */
    /*----------------------------------------------------------------------------*/        
    /* baudレートコンフィグレーションレジスタLow */
    /*----------------------------------------------------------------------------*/        
        C1NBTCFGL	= 0x0000u;	
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            C1NBTCFGLbits.SJW	= 0u;	/* 同期ジャンプ幅ビット */
            C1NBTCFGLbits.TSEG2	= 0u;	/* タイムセグメント2時間選択ビット */
#endif /* コード量削減 */
    /*----------------------------------------------------------------------------*/
    /* baudレートコンフィグレーションレジスタHigh */	
    /*----------------------------------------------------------------------------*/ 
        C1NBTCFGH	= 0x0000u;	
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            C1NBTCFGHbits.TSEG1	= 0u;	/* タイムセグメント1時間選択ビット */
            C1NBTCFGHbits.BRP	= 0u;	/* baudレート プリスケーラ ビット */
#endif /* コード量削減 */
    /*----------------------------------------------------------------------------*/
    /* CANデータビット設定レジスタLow */
    /*----------------------------------------------------------------------------*/
        C1DBTCFGL	= 0x0000u;	
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            C1DBTCFGLbits.SJW	= 0u;	/* 同期ジャンプ幅ビット */
            C1DBTCFGLbits.TSEG2	= 0u;	/* 位相セグメント2時間選択ビット */
#endif /* コード量削減 */
    /*----------------------------------------------------------------------------*/
    /* CANデータビット設定レジスタHigh */
    /*----------------------------------------------------------------------------*/	
        C1DBTCFGH	= 0x0000u;	
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            C1DBTCFGHbits.TSEG1	= 0u;	/* 位相セグメント1時間選択ビット */
            C1DBTCFGHbits.BRP	= 0u;	/* baud レート プリスケーラ ビット */
#endif /* コード量削減 */
    /*----------------------------------------------------------------------------*/
    /* CANトランスミッター遅延補償レジスタLow */
    /*----------------------------------------------------------------------------*/	
        C1TDCL	= 0x0000u;	
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            C1TDCLbits.TDCV	= 0u;	/* トランスミッタ遅延補正値ビット */
            C1TDCLbits.TDCO	= 0u;	/* トランスミッタ遅延補正オフセットビット */
#endif /* コード量削減 */
    /*----------------------------------------------------------------------------*/
    /* CANトランスミッター遅延補償レジスタHigh */
    /*----------------------------------------------------------------------------*/		
        C1TDCH	= 0x0000u;	
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            C1TDCHbits.TDCMOD	= 0u;	/* バス統合中エッジフィルタ有効化ビット */
            C1TDCHbits.SID11EN	= 0u;	/* (CAN-FD)12BitSIDフォーマット有効化ビット */
            C1TDCHbits.EDGFLTEN	= 0u;	/* バス統合中エッジフィルタ有効化ビット */
#endif /* コード量削減 */
    /*----------------------------------------------------------------------------*/
    /* CANタイムベースカウンタレジスタLow */
    /*----------------------------------------------------------------------------*/	
        C1TBCL	= 0x0000u;	
    /*----------------------------------------------------------------------------*/
    /* CANタイムベースカウンタレジスタHigh */
    /*----------------------------------------------------------------------------*/	
        C1TBCH	= 0x0000u;	
    /*----------------------------------------------------------------------------*/
    /* CANタイムスタンプ制御レジスタ */
    /*----------------------------------------------------------------------------*/	
        C1TSCONL	= 0x0000u;	
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            C1TSCONLbits.TBCPRE	= 0u;	/* タイムベースカウンタプリスケーラビット */
#endif /* コード量削減 */
    /*----------------------------------------------------------------------------*/
    /* レジスタ説明 */
    /*----------------------------------------------------------------------------*/		
        C1TSCONH	= 0x0000u;	
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            C1TSCONHbits.TBCEN	= 0u;	/* タイムベースカウンタ有効化ビット */
            C1TSCONHbits.TSEOF	= 0u;	/* タイムスタンプEOFビット */
            C1TSCONHbits.TSRES	= 0u;	/* (CAN-FD)タイムスタンプリセットビット */
#endif /* コード量削減 */
    /*----------------------------------------------------------------------------*/
    /* CAN割り込みフラグコードレジスタLow(受信専用) */
    /*----------------------------------------------------------------------------*/	
        C1VECL	= 0x0000u;	
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            C1VECLbits.ICODE	= 0u;	/* 割り込みフラグコードビット */
            C1VECLbits.FILHIT	= 0u;	/* フィルタヒット番号ビット */
#endif /* コード量削減 */
    /*----------------------------------------------------------------------------*/
    /* CAN割り込みフラグコードレジスタHigh(受信専用) */
    /*----------------------------------------------------------------------------*/		
        C1VECH	= 0x0000u;	
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            C1VECHbits.TXCODE	= 0u;	/* 受信割り込みフラグコードビット */
            C1VECHbits.RXCODE	= 0u;	/* 送信割り込みフラグコードビット */
#endif /* コード量削減 */
    /*----------------------------------------------------------------------------*/
    /* CAN割り込みフラグレジスタ */
    /*----------------------------------------------------------------------------*/
        C1INTL	= 0x0000u;	
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            C1INTLbits.TXIF	= 0u;	/* 送信完了割り込みフラグ */
            C1INTLbits.RXIF	= 0u;	/* 受信完了割り込みフラグ */
            C1INTLbits.TBCIF = 0u;	/* CANタイマーオーバーフロー割り込みフラグ */
            C1INTLbits.MODIF = 0u;	/* モード変化割り込みフラグ */
            C1INTLbits.TEFIF = 0u;	/* 送信イベントFIFO割り込みフラグ */
            C1INTLbits.TXATIF = 0u;	/* 送信試行割り込みフラグ */
            C1INTLbits.RXOVIF =0u;	/* 受信オーバーフロー割り込みフラグ */
            C1INTLbits.SERRIF = 0u;	/* システムエラー割り込みフラグ */
            C1INTLbits.CERRIF = 0u;	/* CANバスエラー割り込みフラグ */
            C1INTLbits.WAKIF = 0u;	/* CANバスアクティビティ復帰割り込みイネーブルビット */
            C1INTLbits.IVMIF = 0u;	/* 無効メッセージ受信割り込みフラグ */
#endif /* コード量削減 */    
    /*----------------------------------------------------------------------------*/
    /* CAN割り込み許可レジスタ */		
    /*----------------------------------------------------------------------------*/
        C1INTH	= 0x0000u;	
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            C1INTHbits.TXIE	= 0u;	/* 送信完了割り込み有効化ビット */
            C1INTHbits.RXIE	= 0u;	/* 受信完了割り込み有効化ビット */
            C1INTHbits.TBCIE = 0u;	/* CANタイマーオーバーフロー割り込み有効化ビット */
            C1INTHbits.MODIE = 0u;	/* モード変化割り込み有効化ビット */
            C1INTHbits.TEFIE = 0u;	/* 送信イベントFIFO割り込み有効化ビット */
            C1INTHbits.TXATIE = 0u;	/* 送信試行割り込み割り込み有効化ビット */
            C1INTHbits.RXOVIE = 0u;	/* 受信オーバーフロー割り込み有効化ビット */
            C1INTHbits.SERRIE = 0u;	/* システムエラー割り込み有効化ビット */
            C1INTHbits.CERRIE = 0u;	/* CANバスエラー割り込み有効化ビット */
            C1INTHbits.WAKIE = 0u;	/* CANバスアクティビティ復帰割り込みイネーブル有効化ビット */
            C1INTHbits.IVMIE = 0u;	/* 無効メッセージ受信割り込み有効化ビット */
#endif /* コード量削減 */        
    /*----------------------------------------------------------------------------*/
    /* CAN受信割り込みステータスレジスタLow */
    /*----------------------------------------------------------------------------*/			
        C1RXIFL	= 0x0000u;	
    /*----------------------------------------------------------------------------*/
    /* CAN受信割り込みステータスレジスタHigh */
    /*----------------------------------------------------------------------------*/			
        C1RXIFH	= 0x0000u;	
    /*----------------------------------------------------------------------------*/
    /* CAN送信割り込みステータスレジスタLow */
    /*----------------------------------------------------------------------------*/			
        C1TXIFL	= 0x0000u;	
    /*----------------------------------------------------------------------------*/
    /* CAN送信割り込みステータスレジスタHigh */
    /*----------------------------------------------------------------------------*/			
        C1TXIFH	= 0x0000u;	
    /*----------------------------------------------------------------------------*/
    /* CAN受信オーバーフロー割り込みステータスレジスタLow */
    /*----------------------------------------------------------------------------*/			
        C1RXOVIFL	= 0x0000u;	
    /*----------------------------------------------------------------------------*/
    /* CAN受信オーバーフロー割り込みステータスレジスタHigh*/
    /*----------------------------------------------------------------------------*/			
        C1RXOVIFH	= 0x0000u;	
    /*----------------------------------------------------------------------------*/
    /* CAN送信試行割り込みステータスレジスタLow */
    /*----------------------------------------------------------------------------*/			
        C1TXATIFL	= 0x0000u;	
    /*----------------------------------------------------------------------------*/
    /* CAN送信試行割り込みステータスレジスタHigh */
    /*----------------------------------------------------------------------------*/			
        C1TXATIFH	= 0x0000u;	
    /*----------------------------------------------------------------------------*/
    /* C1送信リクエストビットLow */		
    /*----------------------------------------------------------------------------*/
        C1TXREQL	= 0x0000u;	
    /*----------------------------------------------------------------------------*/
    /* C1送信リクエストビットHigh */		
    /*----------------------------------------------------------------------------*/   
        C1TXREQH	= 0x0000u;	
    /*----------------------------------------------------------------------------*/
    /* CAN送受信エラーレジスタLow(Read Only) */
    /*----------------------------------------------------------------------------*/		
        C1TRECL	= 0x0000u;	
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            C1TRECLbits.RERRCNT	= 0u;	/* 受信エラーカウンタ(Read Only) */
            C1TRECLbits.TERRCNT	= 0u;	/* 送信エラーカウンタ(Read Only) */
#endif /* コード量削減 */
    /*----------------------------------------------------------------------------*/
    /* CAN送受信エラーレジスタHigh(Read Only) */		
    /*----------------------------------------------------------------------------*/
        C1TRECH	= 0x0000u;	
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            C1TRECHbits.EWARN	= 0u;	/* トランスミッタまたはレシーバが警告エラー状態(Read Only) */
            C1TRECHbits.RXWARN	= 0u;	/* レシーバが警告エラー状態(Read Only) */
            C1TRECHbits.TXWARN	= 0u;	/* トランスミッタが警告エラー状態(Read Only) */
            C1TRECHbits.RXBP	= 0u;	/* レシーバがバスパッシブエラー状態(Read Only)  */
            C1TRECHbits.TXBP	= 0u;	/* トランスミッタがバスパッシブエラー状態(Read Only)  */
            C1TRECHbits.TXBO	= 0u;	/* トランスミッタがバスOFFエラー状態(Read Only) */
#endif /* コード量削減 */
    /*----------------------------------------------------------------------------*/
    /* CANバス診断レジスタ0Low */
    /*----------------------------------------------------------------------------*/
        C1BDIAG0L	= 0x0000u;	
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            C1BDIAG0Lbits.NRERRCNT	= 0u;	/* ノーマルビットレート送信エラーカウント */
            C1BDIAG0Lbits.NTERRCNT	= 0u;	/* ノーマルビットレート受信エラーカウント */
#endif /* コード量削減 */
    /*----------------------------------------------------------------------------*/
    /* CANバス診断レジスタ0High */
    /*----------------------------------------------------------------------------*/	
        C1BDIAG0H	= 0x0000u;	
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            C1BDIAG0Hbits.DRERRCNT	= 0u;	/* データビットレート送信エラーカウント */
            C1BDIAG0Hbits.DTERRCNT	= 0u;	/* データビットレート受信エラーカウント */
#endif /* コード量削減 */
    /*----------------------------------------------------------------------------*/
    /* CANバス診断レジスタ1Low */
    /*----------------------------------------------------------------------------*/		
        C1BDIAG1L	= 0x0000u;	
    /*----------------------------------------------------------------------------*/
    /* CANバス診断レジスタ1High */
    /*----------------------------------------------------------------------------*/		
        C1BDIAG1H	= 0x0000u;	
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            C1BDIAG1Hbits.NBIT0ERR	= 0u;	/* 送信メッセージドミナントレベルエラービット */
            C1BDIAG1Hbits.NBIT1ERR	= 0u;	/* 送信メッセージ受信レベルエラービット */
            C1BDIAG1Hbits.NACKERR	= 0u;	/* 送信メッセージNACKエラービット */
            C1BDIAG1Hbits.NFORMERR	= 0u;	/* 受信フレーム固定フォーマットエラービット */
            C1BDIAG1Hbits.NSTUFERR	= 0u;	/* 不正なシーケンスビットを含む受信メッセージエラービット */
            C1BDIAG1Hbits.NCRCERR	= 0u;	/* CRCを含む受信メッセージが正しくないチェックサムエラービット */
            C1BDIAG1Hbits.TXBOERR	= 0u;	/* デバイスバスオフエラービット */
            C1BDIAG1Hbits.DBIT0ERR	= 0u;	/* 送信メッセージドミナントレベルエラービット */
            C1BDIAG1Hbits.DBIT1ERR	= 0u;	/* 送信メッセージ受信レベルエラービット */
            C1BDIAG1Hbits.DFORMERR	= 0u;	/* 送信メッセージNACKエラービット */
            C1BDIAG1Hbits.DSTUFERR	= 0u;	/* 不正なシーケンスビットを含む受信メッセージエラー */
            C1BDIAG1Hbits.DCRCERR	= 0u;	/* CRCを含む受信メッセージが正しくないチェックサムエラービット */
            C1BDIAG1Hbits.ESI	= 0u;       /* 受信したCAN FDメッセージセットのESIフラグビット */
            C1BDIAG1Hbits.DLCMM	= 0u;       /* DLCミスマッチビット */
#endif /* コード量削減 */
    /*----------------------------------------------------------------------------*/
    /* CAN送信イベントFIFO制御レジスタLow */
    /*----------------------------------------------------------------------------*/	
        C1TEFCONL	= 0x0000u;	
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            C1TEFCONLbits.TEFNEIE	= 0u;	/* 送信イベントFIFO未空割り込み有効化ビット */
            C1TEFCONLbits.TEFHIE	= 0u;	/* 送信イベントFIFOハーフフル割り込み有効化ビット */
            C1TEFCONLbits.TEFFIE	= 0u;	/* 送信イベントFIFOフル割り込み有効化ビット */
            C1TEFCONLbits.TEFOVIE	= 0u;	/* 送信イベントFIFOオーバーフロー割り込み有効化ビット */
            C1TEFCONLbits.TEFTSEN	= 0u;	/* 送信イベントFIFOタイムスタンプ有効化ビット */
            C1TEFCONLbits.UINC	= 0u;       /* インクリメント ヘッド / テールビット */
            C1TEFCONLbits.FRESET	= 0u;	/*  FIFO リセットビット */
#endif /* コード量削減 */
    /*----------------------------------------------------------------------------*/
    /* CAN送信イベントFIFO制御レジスタHigh */
    /*----------------------------------------------------------------------------*/		
        C1TEFCONH	= 0x0000u;	
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            C1TEFCONHbits.FSIZE	= 0u;       /* FIFO サイズビット  */
#endif /* コード量削減 */
    /*----------------------------------------------------------------------------*/
    /* CAN送信イベントFIFOステータスレジスタ */
    /*----------------------------------------------------------------------------*/	
        C1TEFSTA	= 0x0000u;	
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            C1TEFSTAbits.TEFNEIF = 0u;	/* 送信イベントFIFO未空割り込みフラグビット */
            C1TEFSTAbits.TEFHIF	= 0u;	/* 送信イベントFIFOハーフフル割り込みフラグビット */
            C1TEFSTAbits.TEFFIF	= 0u;	/* 送信イベントFIFOフル割り込みフラグビット */
            C1TEFSTAbits.TEFOVIF = 0u;	/* 送信イベントFIFOオーバーフロー割り込みフラグビット */
#endif /* コード量削減 */
    /*----------------------------------------------------------------------------*/
    /*  CAN送信イベントFIFOユーザーアドレスレジスタLow */
    /*----------------------------------------------------------------------------*/		
        C1TEFUAL	= 0x0000u;	
    /*----------------------------------------------------------------------------*/
    /* CAN送信イベントFIFOユーザーアドレスレジスタHigh */
    /*----------------------------------------------------------------------------*/		
        C1TEFUAH	= 0x0000u;	
    /*----------------------------------------------------------------------------*/
    /* CANメッセージメモリーベースアドレスレジスタLow */
    /*----------------------------------------------------------------------------*/	
        C1FIFOBAL	= 0x0000u;	
    /*----------------------------------------------------------------------------*/
    /* CANメッセージメモリーベースアドレスレジスタHigh */
    /*----------------------------------------------------------------------------*/		
        C1FIFOBAH	= 0x0000u;	
    /*----------------------------------------------------------------------------*/
    /* CAN送信キュー制御レジスタLow */
    /*----------------------------------------------------------------------------*/		
        C1TXQCONL	= 0x0000u;	
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            C1TXQCONLbits.TXQNIE = 0u;	/* 送信キュー未空割り込み有効化ビット */
            C1TXQCONLbits.TXQEIE = 0u;	/* 送信キュー空割り込み有効化ビット */
            C1TXQCONLbits.TXATIE = 0u;	/* 送信試行割り込み済み割り込み有効化ビット */
            C1TXQCONLbits.TXEN	= 0u;	/* TX/RX バッファ選択ビット */
            C1TXQCONLbits.UINC	= 0u;	/* インクリメント ヘッド / テールビット */
            C1TXQCONLbits.TXREQ	= 0u;	/* メッセージ送信要求 */
            C1TXQCONLbits.FRESET = 0u;	/*  FIFO リセットビット */
#endif /* コード量削減 */
    /*----------------------------------------------------------------------------*/
    /* CAN送信キュー制御レジスタHigh */
    /*----------------------------------------------------------------------------*/	
        C1TXQCONH	= 0x0000u;	
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            C1TXQCONHbits.TXPRI	= 0u;	/* 送信プライオリティビット */
            C1TXQCONHbits.TXAT	= 0u;	/* 再送試行ビット */
            C1TXQCONHbits.FSIZE	= 0u;	/* FIFO サイズビット  */
            C1TXQCONHbits.PLSIZE = 0u;	/* ペイロードサイズビット */
#endif /* コード量削減 */
    /*----------------------------------------------------------------------------*/
    /* CAN送信キューステータスレジスタ */
    /*----------------------------------------------------------------------------*/		
        C1TXQSTA	= 0x0000u;	
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            C1TXQSTAbits.TXQNIF	= 0u;	/* 送信キュー未空割り込みフラグビット */
            C1TXQSTAbits.TXQEIF	= 0u;	/* 送信キュー空割り込みフラグビット */
            C1TXQSTAbits.TXATIF	= 0u;	/* 送信試行割り込み済み割り込みフラグビット */
            C1TXQSTAbits.TXERR	= 0u;	/* 送信中に検出されたエラービット */
            C1TXQSTAbits.TXLARB	= 0u;	/* メッセージロストアービトレーションステータスビット */
            C1TXQSTAbits.TXABT	= 0u;	/* メッセージ廃棄ステータスビット */
            C1TXQSTAbits.TXQCI	= 0u;	/* 送信メッセージキューインデックスビット */
#endif /* コード量削減 */
    /*----------------------------------------------------------------------------*/
    /* CAN送信キューユーザーアドレスレジスタLow */
    /*----------------------------------------------------------------------------*/		
        C1TXQUAL	= 0x0000u;	
    /*----------------------------------------------------------------------------*/
    /* CAN送信キューユーザーアドレスレジスタHigh */
    /*----------------------------------------------------------------------------*/		
        C1TXQUAH	= 0x0000u;	
    /*----------------------------------------------------------------------------*/
    /* CAN1FIFO制御レジスタ1Low */	
    /*----------------------------------------------------------------------------*/
        C1FIFOCON1L	= 0x0000u;	
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            C1FIFOCON1Lbits.TFNRFNIE = 0u;	/* 送受信複合割り込み有効化ビット */
            C1FIFOCON1Lbits.TFHRFHIE = 0u;	/* 送受信複合割り込み有効化ビット */
            C1FIFOCON1Lbits.TFERFFIE = 0u;	/* 送受信複合割り込み有効化ビット */
            C1FIFOCON1Lbits.RXOVIE	= 0u;	/* 送信 FIFO 非フル割り込みイネーブルビット */
            C1FIFOCON1Lbits.TXATIE	= 0u;	/* 送信試み割り込み済み割り込みイネーブルビット */
            C1FIFOCON1Lbits.RXTSEN	= 0u;	/* 受信メッセージタイムスタンプ有効化ビット */
            C1FIFOCON1Lbits.RTREN	= 0u;	/* 自動RTR有効ビット */
            C1FIFOCON1Lbits.TXEN	= 0u;	/* TX/RX バッファ選択ビット */
            C1FIFOCON1Lbits.UINC	= 0u;	/* インクリメント ヘッド / テールビット */
            C1FIFOCON1Lbits.TXREQ	= 0u;	/* メッセージ送信要求 */
            C1FIFOCON1Lbits.FRESET	= 0u;	/*  FIFO リセットビット */
#endif /* コード量削減 */
    /*----------------------------------------------------------------------------*/
    /* CAN1FIFO制御レジスタ1High */	
    /*----------------------------------------------------------------------------*/
        C1FIFOCON1H	= 0x0000u;	
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            C1FIFOCON1Hbits.TXPRI	= 0u;	/* 送信プライオリティビット */
            C1FIFOCON1Hbits.TXAT	= 0u;	/* 再送試行ビット */
            C1FIFOCON1Hbits.FSIZE	= 0u;	/* FIFO サイズビット  */
            C1FIFOCON1Hbits.PLSIZE	= 0u;	/* ペイロードサイズビット */
#endif /* コード量削減 */
    /*----------------------------------------------------------------------------*/
    /* CAN1FIFOステータスレジスタ1 */		
    /*----------------------------------------------------------------------------*/
        C1FIFOSTA1	= 0x0000u;	
 #if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            C1FIFOSTA1bits.TFNRFNIF	= 0u;	/* 送受信複合割り込みフラグビット */
            C1FIFOSTA1bits.TFHRFHIF	= 0u;	/* 送受信複合割り込みフラグビット */
            C1FIFOSTA1bits.TFERFFIF	= 0u;	/* 送受信複合割り込みフラグビット */
            C1FIFOSTA1bits.RXOVIF	= 0u;	/* 送信 FIFO 非フル割り込みイネーブルビット */
            C1FIFOSTA1bits.TXATIF	= 0u;	/* 送信試行割り込み済み割り込みフラグビット */
            C1FIFOSTA1bits.TXERR	= 0u;	/* 送信中に検出されたエラービット */
            C1FIFOSTA1bits.TXLARB	= 0u;	/* メッセージロストアービトレーションステータスビット */
            C1FIFOSTA1bits.TXABT	= 0u;	/* メッセージ廃棄ステータスビット */
            C1FIFOSTA1bits.FIFOCI	= 0u;	/* FIFOメッセージインデックスビット */
#endif /* コード量削減 */
    /*----------------------------------------------------------------------------*/
    /* CAN FIFOユーザレジスタ1Low */		
    /*----------------------------------------------------------------------------*/         
        C1FIFOUA1L	= 0x0000u;	
    /*----------------------------------------------------------------------------*/
    /* CAN FIFOユーザレジスタ1High */		
    /*----------------------------------------------------------------------------*/ 
        C1FIFOUA1H	= 0x0000u;	
    /*----------------------------------------------------------------------------*/
    /* CAN1FIFO制御レジスタ2Low */		
    /*----------------------------------------------------------------------------*/
        C1FIFOCON2L	= 0x0000u;	
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            C1FIFOCON2Lbits.TFNRFNIE = 0u;	/* 送受信複合割り込み有効化ビット */
            C1FIFOCON2Lbits.TFHRFHIE = 0u;	/* 送受信複合割り込み有効化ビット */
            C1FIFOCON2Lbits.TFERFFIE = 0u;	/* 送受信複合割り込み有効化ビット */
            C1FIFOCON2Lbits.RXOVIE	= 0u;	/* 送信 FIFO 非フル割り込みイネーブルビット */
            C1FIFOCON2Lbits.TXATIE	= 0u;	/* 送信試み割り込み済み割り込みイネーブルビット */
            C1FIFOCON2Lbits.RXTSEN	= 0u;	/* 受信メッセージタイムスタンプ有効化ビット */
            C1FIFOCON2Lbits.RTREN	= 0u;	/* 自動RTR有効ビット */
            C1FIFOCON2Lbits.TXEN	= 0u;	/* TX/RX バッファ選択ビット */
            C1FIFOCON2Lbits.UINC	= 0u;	/* インクリメント ヘッド / テールビット */
            C1FIFOCON2Lbits.TXREQ	= 0u;	/* メッセージ送信要求 */
            C1FIFOCON2Lbits.FRESET	= 0u;	/*  FIFO リセットビット */
#endif /* コード量削減 */
    /*----------------------------------------------------------------------------*/
    /* CAN1FIFO制御レジスタ2High */		
    /*----------------------------------------------------------------------------*/
        C1FIFOCON2H	= 0x0000u;	
 #if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            C1FIFOCON2Hbits.TXPRI	= 0u;	/* 送信プライオリティビット */
            C1FIFOCON2Hbits.TXAT	= 0u;	/* 再送試行ビット */
            C1FIFOCON2Hbits.FSIZE	= 0u;	/* FIFO サイズビット  */
            C1FIFOCON2Hbits.PLSIZE	= 0u;	/* ペイロードサイズビット */
#endif /* コード量削減 */
    /*----------------------------------------------------------------------------*/
    /* CAN1FIFOステータスレジスタ2 */		
    /*----------------------------------------------------------------------------*/
        C1FIFOSTA2	= 0x0000u;	
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            C1FIFOSTA2bits.TFNRFNIF	= 0u;	/* 送受信複合割り込みフラグビット */
            C1FIFOSTA2bits.TFHRFHIF	= 0u;	/* 送受信複合割り込みフラグビット */
            C1FIFOSTA2bits.TFERFFIF	= 0u;	/* 送受信複合割り込みフラグビット */
            C1FIFOSTA2bits.RXOVIF	= 0u;	/* 送信 FIFO 非フル割り込みイネーブルビット */
            C1FIFOSTA2bits.TXATIF	= 0u;	/* 送信試行割り込み済み割り込みフラグビット */
            C1FIFOSTA2bits.TXERR	= 0u;	/* 送信中に検出されたエラービット */
            C1FIFOSTA2bits.TXLARB	= 0u;	/* メッセージロストアービトレーションステータスビット */
            C1FIFOSTA2bits.TXABT	= 0u;	/* メッセージ廃棄ステータスビット */
            C1FIFOSTA2bits.FIFOCI	= 0u;	/* FIFOメッセージインデックスビット */
#endif /* コード量削減 */
    /*----------------------------------------------------------------------------*/
    /* CAN FIFOユーザレジスタ2Low */
    /*----------------------------------------------------------------------------*/
        C1FIFOUA2L	= 0x0000u;	
    /*----------------------------------------------------------------------------*/
    /* CAN FIFOユーザレジスタ2High */		
    /*----------------------------------------------------------------------------*/
        C1FIFOUA2H	= 0x0000u;	
    /*----------------------------------------------------------------------------*/
    /* CAN1FIFO制御レジスタ3Low */		
    /*----------------------------------------------------------------------------*/
        C1FIFOCON3L	= 0x0000u;	
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            C1FIFOCON3Lbits.TFNRFNIE = 0u;	/* 送受信複合割り込み有効化ビット */
            C1FIFOCON3Lbits.TFHRFHIE = 0u;	/* 送受信複合割り込み有効化ビット */
            C1FIFOCON3Lbits.TFERFFIE = 0u;	/* 送受信複合割り込み有効化ビット */
            C1FIFOCON3Lbits.RXOVIE	= 0u;	/* 送信 FIFO 非フル割り込みイネーブルビット */
            C1FIFOCON3Lbits.TXATIE	= 0u;	/* 送信試み割り込み済み割り込みイネーブルビット */
            C1FIFOCON3Lbits.RXTSEN	= 0u;	/* 受信メッセージタイムスタンプ有効化ビット */
            C1FIFOCON3Lbits.RTREN	= 0u;	/* 自動RTR有効ビット */
            C1FIFOCON3Lbits.TXEN	= 0u;	/* TX/RX バッファ選択ビット */
            C1FIFOCON3Lbits.UINC	= 0u;	/* インクリメント ヘッド / テールビット */
            C1FIFOCON3Lbits.TXREQ	= 0u;	/* メッセージ送信要求 */
            C1FIFOCON3Lbits.FRESET	= 0u;	/*  FIFO リセットビット */
#endif /* コード量削減 */
    /*----------------------------------------------------------------------------*/
    /* CAN1FIFO制御レジスタ3High */		
    /*----------------------------------------------------------------------------*/
        C1FIFOCON3H	= 0x0000u;	
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            C1FIFOCON3Hbits.TXPRI	= 0u;	/* 送信プライオリティビット */
            C1FIFOCON3Hbits.TXAT	= 0u;	/* 再送試行ビット */
            C1FIFOCON3Hbits.FSIZE	= 0u;	/* FIFO サイズビット  */
            C1FIFOCON3Hbits.PLSIZE	= 0u;	/* ペイロードサイズビット */
#endif /* コード量削減 */
    /*----------------------------------------------------------------------------*/
    /* CAN1FIFOステータスレジスタ3 */		
    /*----------------------------------------------------------------------------*/
        C1FIFOSTA3	= 0x0000u;	
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            C1FIFOSTA3bits.TFNRFNIF	= 0u;	/* 送受信複合割り込みフラグビット */
            C1FIFOSTA3bits.TFHRFHIF	= 0u;	/* 送受信複合割り込みフラグビット */
            C1FIFOSTA3bits.TFERFFIF	= 0u;	/* 送受信複合割り込みフラグビット */
            C1FIFOSTA3bits.RXOVIF	= 0u;	/* 送信 FIFO 非フル割り込みイネーブルビット */
            C1FIFOSTA3bits.TXATIF	= 0u;	/* 送信試行割り込み済み割り込みフラグビット */
            C1FIFOSTA3bits.TXERR	= 0u;	/* 送信中に検出されたエラービット */
            C1FIFOSTA3bits.TXLARB	= 0u;	/* メッセージロストアービトレーションステータスビット */
            C1FIFOSTA3bits.TXABT	= 0u;	/* メッセージ廃棄ステータスビット */
            C1FIFOSTA3bits.FIFOCI	= 0u;	/* FIFOメッセージインデックスビット */
#endif /* コード量削減 */
    /*----------------------------------------------------------------------------*/
    /* CAN FIFOユーザレジスタ3Low */		
    /*----------------------------------------------------------------------------*/
        C1FIFOUA3L	= 0x0000u;	
    /*----------------------------------------------------------------------------*/
    /* CAN FIFOユーザレジスタ3High */
    /*----------------------------------------------------------------------------*/
        C1FIFOUA3H	= 0x0000u;	
    /*----------------------------------------------------------------------------*/
    /* CAN1FIFO制御レジスタ4Low */	
    /*----------------------------------------------------------------------------*/
        C1FIFOCON4L	= 0x0000u;	
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            C1FIFOCON4Lbits.TFNRFNIE = 0u;	/* 送受信複合割り込み有効化ビット */
            C1FIFOCON4Lbits.TFHRFHIE = 0u;	/* 送受信複合割り込み有効化ビット */
            C1FIFOCON4Lbits.TFERFFIE = 0u;	/* 送受信複合割り込み有効化ビット */
            C1FIFOCON4Lbits.RXOVIE	= 0u;	/* 送信 FIFO 非フル割り込みイネーブルビット */
            C1FIFOCON4Lbits.TXATIE	= 0u;	/* 送信試み割り込み済み割り込みイネーブルビット */
            C1FIFOCON4Lbits.RXTSEN	= 0u;	/* 受信メッセージタイムスタンプ有効化ビット */
            C1FIFOCON4Lbits.RTREN	= 0u;	/* 自動RTR有効ビット */
            C1FIFOCON4Lbits.TXEN	= 0u;	/* TX/RX バッファ選択ビット */
            C1FIFOCON4Lbits.UINC	= 0u;	/* インクリメント ヘッド / テールビット */
            C1FIFOCON4Lbits.TXREQ	= 0u;	/* メッセージ送信要求 */
            C1FIFOCON4Lbits.FRESET	= 0u;	/*  FIFO リセットビット */
#endif /* コード量削減 */
    /*----------------------------------------------------------------------------*/
    /* CAN1FIFO制御レジスタ4High */		
    /*----------------------------------------------------------------------------*/
        C1FIFOCON4H	= 0x0000u;	
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            C1FIFOCON4Hbits.TXPRI	= 0u;	/* 送信プライオリティビット */
            C1FIFOCON4Hbits.TXAT	= 0u;	/* 再送試行ビット */
            C1FIFOCON4Hbits.FSIZE	= 0u;	/* FIFO サイズビット  */
            C1FIFOCON4Hbits.PLSIZE	= 0u;	/* ペイロードサイズビット */
#endif /* コード量削減 */
    /*----------------------------------------------------------------------------*/
    /* CAN1FIFOステータスレジスタ4 */		
    /*----------------------------------------------------------------------------*/
        C1FIFOSTA4	= 0x0000u;	
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            C1FIFOSTA4bits.TFNRFNIF	= 0u;	/* 送受信複合割り込みフラグビット */
            C1FIFOSTA4bits.TFHRFHIF	= 0u;	/* 送受信複合割り込みフラグビット */
            C1FIFOSTA4bits.TFERFFIF	= 0u;	/* 送受信複合割り込みフラグビット */
            C1FIFOSTA4bits.RXOVIF	= 0u;	/* 送信 FIFO 非フル割り込みイネーブルビット */
            C1FIFOSTA4bits.TXATIF	= 0u;	/* 送信試行割り込み済み割り込みフラグビット */
            C1FIFOSTA4bits.TXERR	= 0u;	/* 送信中に検出されたエラービット */
            C1FIFOSTA4bits.TXLARB	= 0u;	/* メッセージロストアービトレーションステータスビット */
            C1FIFOSTA4bits.TXABT	= 0u;	/* メッセージ廃棄ステータスビット */
            C1FIFOSTA4bits.FIFOCI	= 0u;	/* FIFOメッセージインデックスビット */
#endif /* コード量削減 */
    /*----------------------------------------------------------------------------*/
    /* CAN FIFOユーザレジスタ4Low */		
    /*----------------------------------------------------------------------------*/
        C1FIFOUA4L	= 0x0000u;	
    /*----------------------------------------------------------------------------*/
    /* CAN FIFOユーザレジスタ4High */		
    /*----------------------------------------------------------------------------*/
        C1FIFOUA4H	= 0x0000u;	
    /*----------------------------------------------------------------------------*/
    /* CAN1FIFO制御レジスタ5Low */		
    /*----------------------------------------------------------------------------*/
        C1FIFOCON5L	= 0x0000u;	
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            C1FIFOCON5Lbits.TFNRFNIE = 0u;	/* 送受信複合割り込み有効化ビット */
            C1FIFOCON5Lbits.TFHRFHIE = 0u;	/* 送受信複合割り込み有効化ビット */
            C1FIFOCON5Lbits.TFERFFIE = 0u;	/* 送受信複合割り込み有効化ビット */
            C1FIFOCON5Lbits.RXOVIE	= 0u;	/* 送信 FIFO 非フル割り込みイネーブルビット */
            C1FIFOCON5Lbits.TXATIE	= 0u;	/* 送信試み割り込み済み割り込みイネーブルビット */
            C1FIFOCON5Lbits.RXTSEN	= 0u;	/* 受信メッセージタイムスタンプ有効化ビット */
            C1FIFOCON5Lbits.RTREN	= 0u;	/* 自動RTR有効ビット */
            C1FIFOCON5Lbits.TXEN	= 0u;	/* TX/RX バッファ選択ビット */
            C1FIFOCON5Lbits.UINC	= 0u;	/* インクリメント ヘッド / テールビット */
            C1FIFOCON5Lbits.TXREQ	= 0u;	/* メッセージ送信要求 */
            C1FIFOCON5Lbits.FRESET	= 0u;	/*  FIFO リセットビット */
#endif /* コード量削減 */
    /*----------------------------------------------------------------------------*/
    /* CAN1FIFO制御レジスタ5High */		
    /*----------------------------------------------------------------------------*/
        C1FIFOCON5H	= 0x0000u;	
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            C1FIFOCON5Hbits.TXPRI	= 0u;	/* 送信プライオリティビット */
            C1FIFOCON5Hbits.TXAT	= 0u;	/* 再送試行ビット */
            C1FIFOCON5Hbits.FSIZE	= 0u;	/* FIFO サイズビット  */
            C1FIFOCON5Hbits.PLSIZE	= 0u;	/* ペイロードサイズビット */
#endif /* コード量削減 */
    /*----------------------------------------------------------------------------*/
    /* CAN1FIFOステータスレジスタ5 */	
    /*----------------------------------------------------------------------------*/
        C1FIFOSTA5	= 0x0000u;	
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            C1FIFOSTA5bits.TFNRFNIF	= 0u;	/* 送受信複合割り込みフラグビット */
            C1FIFOSTA5bits.TFHRFHIF	= 0u;	/* 送受信複合割り込みフラグビット */
            C1FIFOSTA5bits.TFERFFIF	= 0u;	/* 送受信複合割り込みフラグビット */
            C1FIFOSTA5bits.RXOVIF	= 0u;	/* 送信 FIFO 非フル割り込みイネーブルビット */
            C1FIFOSTA5bits.TXATIF	= 0u;	/* 送信試行割り込み済み割り込みフラグビット */
            C1FIFOSTA5bits.TXERR	= 0u;	/* 送信中に検出されたエラービット */
            C1FIFOSTA5bits.TXLARB	= 0u;	/* メッセージロストアービトレーションステータスビット */
            C1FIFOSTA5bits.TXABT	= 0u;	/* メッセージ廃棄ステータスビット */
            C1FIFOSTA5bits.FIFOCI	= 0u;	/* FIFOメッセージインデックスビット */
#endif /* コード量削減 */
    /*----------------------------------------------------------------------------*/
    /* CAN FIFOユーザレジスタ5Low */		
    /*----------------------------------------------------------------------------*/
        C1FIFOUA5L	= 0x0000u;	
    /*----------------------------------------------------------------------------*/
    /* CAN FIFOユーザレジスタ5High */	
    /*----------------------------------------------------------------------------*/
        C1FIFOUA5H	= 0x0000u;	
    /*----------------------------------------------------------------------------*/
    /* CAN1FIFO制御レジスタ6Low */		
    /*----------------------------------------------------------------------------*/
        C1FIFOCON6L	= 0x0000u;	
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            C1FIFOCON6Lbits.TFNRFNIE = 0u;	/* 送受信複合割り込み有効化ビット */
            C1FIFOCON6Lbits.TFHRFHIE = 0u;	/* 送受信複合割り込み有効化ビット */
            C1FIFOCON6Lbits.TFERFFIE = 0u;	/* 送受信複合割り込み有効化ビット */
            C1FIFOCON6Lbits.RXOVIE	= 0u;	/* 送信 FIFO 非フル割り込みイネーブルビット */
            C1FIFOCON6Lbits.TXATIE	= 0u;	/* 送信試み割り込み済み割り込みイネーブルビット */
            C1FIFOCON6Lbits.RXTSEN	= 0u;	/* 受信メッセージタイムスタンプ有効化ビット */
            C1FIFOCON6Lbits.RTREN	= 0u;	/* 自動RTR有効ビット */
            C1FIFOCON6Lbits.TXEN	= 0u;	/* TX/RX バッファ選択ビット */
            C1FIFOCON6Lbits.UINC	= 0u;	/* インクリメント ヘッド / テールビット */
            C1FIFOCON6Lbits.TXREQ	= 0u;	/* メッセージ送信要求 */
            C1FIFOCON6Lbits.FRESET	= 0u;	/*  FIFO リセットビット */
#endif /* コード量削減 */
    /*----------------------------------------------------------------------------*/
    /* CAN1FIFO制御レジスタ6High */	
    /*----------------------------------------------------------------------------*/
        C1FIFOCON6H	= 0x0000u;	
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            C1FIFOCON6Hbits.TXPRI	= 0u;	/* 送信プライオリティビット */
            C1FIFOCON6Hbits.TXAT	= 0u;	/* 再送試行ビット */
            C1FIFOCON6Hbits.FSIZE	= 0u;	/* FIFO サイズビット  */
            C1FIFOCON6Hbits.PLSIZE	= 0u;	/* ペイロードサイズビット */
#endif /* コード量削減 */
    /*----------------------------------------------------------------------------*/
    /* CAN1FIFOステータスレジスタ6 */		
    /*----------------------------------------------------------------------------*/
        C1FIFOSTA6	= 0x0000u;	
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            C1FIFOSTA6bits.TFNRFNIF	= 0u;	/* 送受信複合割り込みフラグビット */
            C1FIFOSTA6bits.TFHRFHIF	= 0u;	/* 送受信複合割り込みフラグビット */
            C1FIFOSTA6bits.TFERFFIF	= 0u;	/* 送受信複合割り込みフラグビット */
            C1FIFOSTA6bits.RXOVIF	= 0u;	/* 送信 FIFO 非フル割り込みイネーブルビット */
            C1FIFOSTA6bits.TXATIF	= 0u;	/* 送信試行割り込み済み割り込みフラグビット */
            C1FIFOSTA6bits.TXERR	= 0u;	/* 送信中に検出されたエラービット */
            C1FIFOSTA6bits.TXLARB	= 0u;	/* メッセージロストアービトレーションステータスビット */
            C1FIFOSTA6bits.TXABT	= 0u;	/* メッセージ廃棄ステータスビット */
            C1FIFOSTA6bits.FIFOCI	= 0u;	/* FIFOメッセージインデックスビット */
#endif /* コード量削減 */
    /*----------------------------------------------------------------------------*/
    /* CAN FIFOユーザレジスタ6Low */		
    /*----------------------------------------------------------------------------*/
        C1FIFOUA6L	= 0x0000u;	
    /*----------------------------------------------------------------------------*/
    /* CAN FIFOユーザレジスタ6High */	
    /*----------------------------------------------------------------------------*/
        C1FIFOUA6H	= 0x0000u;	
    /*----------------------------------------------------------------------------*/
    /* CAN1FIFO制御レジスタ7Low */
    /*----------------------------------------------------------------------------*/
        C1FIFOCON7L	= 0x0000u;	
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            C1FIFOCON7Lbits.TFNRFNIE = 0u;	/* 送受信複合割り込み有効化ビット */
            C1FIFOCON7Lbits.TFHRFHIE = 0u;	/* 送受信複合割り込み有効化ビット */
            C1FIFOCON7Lbits.TFERFFIE = 0u;	/* 送受信複合割り込み有効化ビット */
            C1FIFOCON7Lbits.RXOVIE	= 0u;	/* 送信 FIFO 非フル割り込みイネーブルビット */
            C1FIFOCON7Lbits.TXATIE	= 0u;	/* 送信試み割り込み済み割り込みイネーブルビット */
            C1FIFOCON7Lbits.RXTSEN	= 0u;	/* 受信メッセージタイムスタンプ有効化ビット */
            C1FIFOCON7Lbits.RTREN	= 0u;	/* 自動RTR有効ビット */
            C1FIFOCON7Lbits.TXEN	= 0u;	/* TX/RX バッファ選択ビット */
            C1FIFOCON7Lbits.UINC	= 0u;	/* インクリメント ヘッド / テールビット */
            C1FIFOCON7Lbits.TXREQ	= 0u;	/* メッセージ送信要求 */
            C1FIFOCON7Lbits.FRESET	= 0u;	/*  FIFO リセットビット */
#endif /* コード量削減 */
    /*----------------------------------------------------------------------------*/
    /* CAN1FIFO制御レジスタ7High */		
    /*----------------------------------------------------------------------------*/
        C1FIFOCON7H	= 0x0000u;	
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            C1FIFOCON7Hbits.TXPRI	= 0u;	/* 送信プライオリティビット */
            C1FIFOCON7Hbits.TXAT	= 0u;	/* 再送試行ビット */
            C1FIFOCON7Hbits.FSIZE	= 0u;	/* FIFO サイズビット  */
            C1FIFOCON7Hbits.PLSIZE	= 0u;	/* ペイロードサイズビット */
#endif /* コード量削減 */
    /*----------------------------------------------------------------------------*/
    /* CAN1FIFOステータスレジスタ7 */		
    /*----------------------------------------------------------------------------*/
        C1FIFOSTA7	= 0x0000u;	
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            C1FIFOSTA7bits.TFNRFNIF	= 0u;	/* 送受信複合割り込みフラグビット */
            C1FIFOSTA7bits.TFHRFHIF	= 0u;	/* 送受信複合割り込みフラグビット */
            C1FIFOSTA7bits.TFERFFIF	= 0u;	/* 送受信複合割り込みフラグビット */
            C1FIFOSTA7bits.RXOVIF	= 0u;	/* 送信 FIFO 非フル割り込みイネーブルビット */
            C1FIFOSTA7bits.TXATIF	= 0u;	/* 送信試行割り込み済み割り込みフラグビット */
            C1FIFOSTA7bits.TXERR	= 0u;	/* 送信中に検出されたエラービット */
            C1FIFOSTA7bits.TXLARB	= 0u;	/* メッセージロストアービトレーションステータスビット */
            C1FIFOSTA7bits.TXABT	= 0u;	/* メッセージ廃棄ステータスビット */
            C1FIFOSTA7bits.FIFOCI	= 0u;	/* FIFOメッセージインデックスビット */
#endif /* コード量削減 */
    /*----------------------------------------------------------------------------*/
    /* CAN FIFOユーザレジスタ7Low */		
    /*----------------------------------------------------------------------------*/
        C1FIFOUA7L	= 0x0000u;	
    /*----------------------------------------------------------------------------*/
    /* CAN FIFOユーザレジスタ7High */	
     /*----------------------------------------------------------------------------*/
        C1FIFOUA7H	= 0x0000u;	

        u2g_ECAN1_Init_FilterCon();
        u2g_ECAN1_Init_FilterObj();    	
}
/*----------------------------------------------------------------------------*/
/*
* @fn       u2g_ECAN1_Init_FilterCon(void)
* @brief       フィルタ制御レジスタを初期化します
* @param
* @return	ECAN1_DRV_RET
* @detail 
*/
/*----------------------------------------------------------------------------*/
ECAN1_DRV_RET u2g_ECAN1_Init_FilterCon(void)
{
    /*----------------------------------------------------------------------------*/
    /* ECAN1フィルタバッファ制御レジスタ0Low */	
    /*----------------------------------------------------------------------------*/
        C1FLTCON0L	= (( ECAN1_FILTER1_ENABLE & 0x01u ) << 15u) | 
                      (( ECAN1_FILTER1_FIFO & 0x1Fu ) << 8u) |
                      (( ECAN1_FILTER0_ENABLE & 0x01u ) << 7u) | 
                      ( ECAN1_FILTER0_FIFO & 0x1Fu );
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            C1FLTCON0Lbits.F0BP	= 0u;	/* フィルタ0受信バッファポインタ */
            C1FLTCON0Lbits.FLTEN0 = 0u;	/* フィルタ0有効化ビット */
            C1FLTCON0Lbits.F1BP	= 0u;	/* フィルタ1受信バッファポインタ */
            C1FLTCON0Lbits.FLTEN1 = 0u;	/* フィルタ1有効化ビット */
#endif /* コード量削減 */
    /*----------------------------------------------------------------------------*/
    /* ECAN1フィルタバッファ制御レジスタ0High */		
    /*----------------------------------------------------------------------------*/
        C1FLTCON0H	= (( ECAN1_FILTER3_ENABLE & 0x01u ) << 15u) | 
                      (( ECAN1_FILTER3_FIFO & 0x1Fu ) << 8u) |
                      (( ECAN1_FILTER2_ENABLE & 0x01u ) << 7u) | 
                      ( ECAN1_FILTER2_FIFO & 0x1Fu );
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            C1FLTCON0Hbits.F2BP	= 0u;	/* フィルタ2受信バッファポインタ */
            C1FLTCON0Hbits.FLTEN2 = 0u;	/* フィルタ2有効化ビット */
            C1FLTCON0Hbits.F3BP	= 0u;	/* フィルタ3受信バッファポインタ */
            C1FLTCON0Hbits.FLTEN3 = 0u;	/* フィルタ3有効化ビット */
#endif /* コード量削減 */
    /*----------------------------------------------------------------------------*/
    /* ECAN1フィルタバッファ制御レジスタ1Low */	
    /*----------------------------------------------------------------------------*/
        C1FLTCON1L	= (( ECAN1_FILTER5_ENABLE & 0x01u ) << 15u) | 
                      (( ECAN1_FILTER5_FIFO & 0x1Fu ) << 8u) |
                      (( ECAN1_FILTER4_ENABLE & 0x01u ) << 7u) | 
                      ( ECAN1_FILTER4_FIFO & 0x1Fu );	
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            C1FLTCON1Lbits.F4BP	= 0u;	/* フィルタ4受信バッファポインタ */
            C1FLTCON1Lbits.FLTEN4 = 0u;	/* フィルタ4有効化ビット */
            C1FLTCON1Lbits.F5BP	= 0u;	/* フィルタ5受信バッファポインタ */
            C1FLTCON1Lbits.FLTEN5 = 0u;	/* フィルタ5有効化ビット */
#endif /* コード量削減 */
    /*----------------------------------------------------------------------------*/
    /* ECAN1フィルタバッファ制御レジスタ1High */	
     /*----------------------------------------------------------------------------*/
        C1FLTCON1H	= (( ECAN1_FILTER7_ENABLE & 0x01u ) << 15u) | 
                      (( ECAN1_FILTER7_FIFO & 0x1Fu ) << 8u) |
                      (( ECAN1_FILTER6_ENABLE & 0x01u ) << 7u) | 
                      ( ECAN1_FILTER6_FIFO & 0x1Fu );	
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            C1FLTCON1Hbits.F6BP	= 0u;	/* フィルタ6受信バッファポインタ */
            C1FLTCON1Hbits.FLTEN6 = 0u;	/* フィルタ6有効化ビット */
            C1FLTCON1Hbits.F7BP	= 0u;	/* フィルタ7受信バッファポインタ */
            C1FLTCON1Hbits.FLTEN7 = 0u;	/* フィルタ7有効化ビット */
#endif /* コード量削減 */
    /*----------------------------------------------------------------------------*/
    /* ECAN1フィルタバッファ制御レジスタ2L */		
    /*----------------------------------------------------------------------------*/
        C1FLTCON2L	= (( ECAN1_FILTER9_ENABLE & 0x01u ) << 15u) | 
                      (( ECAN1_FILTER9_FIFO & 0x1Fu ) << 8u) |
                      (( ECAN1_FILTER8_ENABLE & 0x01u ) << 7u) | 
                      ( ECAN1_FILTER8_FIFO & 0x1Fu );
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            C1FLTCON2Lbits.F8BP	= 0u;	/* フィルタ8受信バッファポインタ */
            C1FLTCON2Lbits.FLTEN8 = 0u;	/* フィルタ8有効化ビット */
            C1FLTCON2Lbits.F9BP	= 0u;	/* フィルタ9受信バッファポインタ */
            C1FLTCON2Lbits.FLTEN9 = 0u;	/* フィルタ9有効化ビット */
#endif /* コード量削減 */
    /*----------------------------------------------------------------------------*/
    /* ECAN1フィルタバッファ制御レジスタ2High */		
    /*----------------------------------------------------------------------------*/
        C1FLTCON2H	= (( ECAN1_FILTER11_ENABLE & 0x01u ) << 15u) | 
                      (( ECAN1_FILTER11_FIFO & 0x1Fu ) << 8u) |
                      (( ECAN1_FILTER10_ENABLE & 0x01u ) << 7u) | 
                      ( ECAN1_FILTER10_FIFO & 0x1Fu );
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            C1FLTCON2Hbits.F10BP	= 0u;	/* フィルタ10受信バッファポインタ */
            C1FLTCON2Hbits.FLTEN10	= 0u;	/* フィルタ10有効化ビット */
            C1FLTCON2Hbits.F11BP	= 0u;	/* フィルタ11受信バッファポインタ */
            C1FLTCON2Hbits.FLTEN11	= 0u;	/* フィルタ11有効化ビット */
#endif /* コード量削減 */
    /*----------------------------------------------------------------------------*/
    /* ECAN1フィルタバッファ制御レジスタ3Low */	
    /*----------------------------------------------------------------------------*/
        C1FLTCON3L	= (( ECAN1_FILTER13_ENABLE & 0x01u ) << 15u) | 
                      (( ECAN1_FILTER13_FIFO & 0x1Fu ) << 8u) |
                      (( ECAN1_FILTER12_ENABLE & 0x01u ) << 7u) | 
                      ( ECAN1_FILTER12_FIFO & 0x1Fu );	
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            C1FLTCON3Lbits.F12BP	= 0u;	/* フィルタ12受信バッファポインタ */
            C1FLTCON3Lbits.FLTEN12	= 0u;	/* フィルタ12有効化ビット */
            C1FLTCON3Lbits.F13BP	= 0u;	/* フィルタ13受信バッファポインタ */
            C1FLTCON3Lbits.FLTEN13	= 0u;	/* フィルタ13有効化ビット */
#endif /* コード量削減 */
    /*----------------------------------------------------------------------------*/
    /* ECAN1フィルタバッファ制御レジスタ3High */	
    /*----------------------------------------------------------------------------*/
        C1FLTCON3H	= (( ECAN1_FILTER15_ENABLE & 0x01u ) << 15u) | 
                      (( ECAN1_FILTER15_FIFO & 0x1Fu ) << 8u) |
                      (( ECAN1_FILTER14_ENABLE & 0x01u ) << 7u) | 
                      ( ECAN1_FILTER14_FIFO & 0x1Fu );	
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            C1FLTCON3Hbits.F14BP	= 0u;	/* フィルタ14受信バッファポインタ */
            C1FLTCON3Hbits.FLTEN14	= 0u;	/* フィルタ14有効化ビット */
            C1FLTCON3Hbits.F15BP	= 0u;	/* フィルタ15受信バッファポインタ */
            C1FLTCON3Hbits.FLTEN15	= 0u;	/* フィルタ15有効化ビット */
#endif /* コード量削減 */
}
/*----------------------------------------------------------------------------*/
/*
* @fn       u2g_ECAN1_Init_FilterObj(void) 
* @brief    フィルタオブジェクトレジスタを初期化します
* @return   ECAN1_DRV_RET
* @detail 
*/
/*----------------------------------------------------------------------------*/
ECAN1_DRV_RET u2g_ECAN1_Init_FilterObj(void)
{
    /*----------------------------------------------------------------------------*/
    /* ECAN1フィルタオブジェクト0Low */	
    /*----------------------------------------------------------------------------*/
        C1FLTOBJ0L	= (( ECAN1_FILTER0_EID & 0x1F) << 11u) | (ECAN1_FILTER0_SID & 0x7FFu);	
    /*----------------------------------------------------------------------------*/
    /* ECAN1フィルタオブジェクト0High */		
    /*----------------------------------------------------------------------------*/
        C1FLTOBJ0H	= ((ECAN1_FILTER0_EXIDE & 0x01 ) << 14u) | ((ECAN1_FILTER0_SID & 0x800u) << 2u) | (( ECAN1_FILTER0_EID >> 5u) & 0x1FFFu);	
    /*----------------------------------------------------------------------------*/
    /* ECAN1マスクレジスタ0Low */		
    /*----------------------------------------------------------------------------*/
        C1MASK0L	= (( ECAN1_MASK0_EID & 0x1F) << 11u) | (ECAN1_MASK0_SID & 0x7FFu);	
    /*----------------------------------------------------------------------------*/
    /* ECAN1マスクレジスタ0High */	
    /*----------------------------------------------------------------------------*/
        C1MASK0H	= ((ECAN1_MASK0_EXIDE & 0x01 ) << 14u) | ((ECAN1_MASK0_SID & 0x800u) << 2u) | (( ECAN1_MASK0_EID >> 5u) & 0x1FFFu);		
    /*----------------------------------------------------------------------------*/
    /* ECAN1フィルタオブジェクト1Low */		
    /*----------------------------------------------------------------------------*/
        C1FLTOBJ1L	= (( ECAN1_FILTER1_EID & 0x1F) << 11u) | (ECAN1_FILTER1_SID & 0x7FFu);;	
    /*----------------------------------------------------------------------------*/
    /* ECAN1フィルタオブジェクト1High */	
    /*----------------------------------------------------------------------------*/
        C1FLTOBJ1H	= ((ECAN1_FILTER1_EXIDE & 0x01 ) << 14u) | ((ECAN1_FILTER1_SID & 0x800u) << 2u) | (( ECAN1_FILTER1_EID >> 5u) & 0x1FFFu);	
    /*----------------------------------------------------------------------------*/
    /* ECAN1マスクレジスタ1Low */		
    /*----------------------------------------------------------------------------*/
        C1MASK1L	= (( ECAN1_MASK1_EID & 0x1F) << 11u) | (ECAN1_MASK1_SID & 0x7FFu);	
    /*----------------------------------------------------------------------------*/
    /* ECAN1マスクレジスタ1High */	
    /*----------------------------------------------------------------------------*/
        C1MASK1H	= ((ECAN1_MASK1_EXIDE & 0x01 ) << 14u) | ((ECAN1_MASK1_SID & 0x800u) << 2u) | (( ECAN1_MASK1_EID >> 5u) & 0x1FFFu);	
    /*----------------------------------------------------------------------------*/
    /* ECAN1フィルタオブジェクト2Low */	
    /*----------------------------------------------------------------------------*/
        C1FLTOBJ2L	= (( ECAN1_FILTER2_EID & 0x1F) << 11u) | (ECAN1_FILTER2_SID & 0x7FFu);;	
    /*----------------------------------------------------------------------------*/
    /* ECAN1フィルタオブジェクト2High */	
    /*----------------------------------------------------------------------------*/
        C1FLTOBJ2H	= ((ECAN1_FILTER2_EXIDE & 0x01 ) << 14u) | ((ECAN1_FILTER2_SID & 0x800u) << 2u) | (( ECAN1_FILTER2_EID >> 5u) & 0x1FFFu);	
    /*----------------------------------------------------------------------------*/
    /* ECAN1マスクレジスタ2Low */		
    /*----------------------------------------------------------------------------*/
        C1MASK2L	= (( ECAN1_MASK2_EID & 0x1F) << 11u) | (ECAN1_MASK2_SID & 0x7FFu);	
    /*----------------------------------------------------------------------------*/
    /* ECAN1マスクレジスタ2High */	
    /*----------------------------------------------------------------------------*/
        C1MASK2H	= ((ECAN1_MASK2_EXIDE & 0x01 ) << 14u) | ((ECAN1_MASK2_SID & 0x800u) << 2u) | (( ECAN1_MASK2_EID >> 5u) & 0x1FFFu);		
    /*----------------------------------------------------------------------------*/
    /* ECAN1フィルタオブジェクト3Low */		
    /*----------------------------------------------------------------------------*/
        C1FLTOBJ3L	= (( ECAN1_FILTER3_EID & 0x1F) << 11u) | (ECAN1_FILTER3_SID & 0x7FFu);;	
    /*----------------------------------------------------------------------------*/
    /* ECAN1フィルタオブジェクト3High */		
    /*----------------------------------------------------------------------------*/
        C1FLTOBJ3H	= ((ECAN1_FILTER3_EXIDE & 0x01 ) << 14u) | ((ECAN1_FILTER3_SID & 0x800u) << 2u) | (( ECAN1_FILTER3_EID >> 5u) & 0x1FFFu);	
    /*----------------------------------------------------------------------------*/
    /* ECAN1マスクレジスタ3Low */	
    /*----------------------------------------------------------------------------*/
        C1MASK3L	= (( ECAN1_MASK3_EID & 0x1F) << 11u) | (ECAN1_MASK3_SID & 0x7FFu);	
    /*----------------------------------------------------------------------------*/
    /* ECAN1マスクレジスタ3High */	
    /*----------------------------------------------------------------------------*/
        C1MASK3H	= ((ECAN1_MASK3_EXIDE & 0x01 ) << 14u) | ((ECAN1_MASK3_SID & 0x800u) << 2u) | (( ECAN1_MASK3_EID >> 5u) & 0x1FFFu);		
    /*----------------------------------------------------------------------------*/
    /* ECAN1フィルタオブジェクト4Low */	
    /*----------------------------------------------------------------------------*/
        C1FLTOBJ4L	= (( ECAN1_FILTER4_EID & 0x1F) << 11u) | (ECAN1_FILTER4_SID & 0x7FFu);;	
    /*----------------------------------------------------------------------------*/
    /* ECAN1フィルタオブジェクト4High */	
    /*----------------------------------------------------------------------------*/
        C1FLTOBJ4H	= ((ECAN1_FILTER4_EXIDE & 0x01 ) << 14u) | ((ECAN1_FILTER4_SID & 0x800u) << 2u) | (( ECAN1_FILTER4_EID >> 5u) & 0x1FFFu);	
    /*----------------------------------------------------------------------------*/
    /* ECAN1マスクレジスタ4Low */		
    /*----------------------------------------------------------------------------*/
        C1MASK4L	= (( ECAN1_MASK4_EID & 0x1F) << 11u) | (ECAN1_MASK4_SID & 0x7FFu);	
    /*----------------------------------------------------------------------------*/
    /* ECAN1マスクレジスタ4High */
    /*----------------------------------------------------------------------------*/
        C1MASK4H	= ((ECAN1_MASK4_EXIDE & 0x01 ) << 14u) | ((ECAN1_MASK4_SID & 0x800u) << 2u) | (( ECAN1_MASK4_EID >> 5u) & 0x1FFFu);		
    /*----------------------------------------------------------------------------*/
    /* ECAN1フィルタオブジェクト5Low */	
    /*----------------------------------------------------------------------------*/
        C1FLTOBJ5L	= (( ECAN1_FILTER5_EID & 0x1F) << 11u) | (ECAN1_FILTER5_SID & 0x7FFu);;	
    /*----------------------------------------------------------------------------*/
    /* ECAN1フィルタオブジェクト5High */
    /*----------------------------------------------------------------------------*/
        C1FLTOBJ5H	= ((ECAN1_FILTER5_EXIDE & 0x01 ) << 14u) | ((ECAN1_FILTER5_SID & 0x800u) << 2u) | (( ECAN1_FILTER5_EID >> 5u) & 0x1FFFu);	
    /*----------------------------------------------------------------------------*/
    /* ECAN1マスクレジスタ5Low */	
    /*----------------------------------------------------------------------------*/
        C1MASK5L	= (( ECAN1_MASK5_EID & 0x1F) << 11u) | (ECAN1_MASK5_SID & 0x7FFu);	
    /*----------------------------------------------------------------------------*/
    /* ECAN1マスクレジスタ5High */	
    /*----------------------------------------------------------------------------*/
        C1MASK5H	= ((ECAN1_MASK5_EXIDE & 0x01 ) << 14u) | ((ECAN1_MASK5_SID & 0x800u) << 2u) | (( ECAN1_MASK5_EID >> 5u) & 0x1FFFu);	
    /*----------------------------------------------------------------------------*/
    /* ECAN1フィルタオブジェクト6Low */	
    /*----------------------------------------------------------------------------*/
        C1FLTOBJ6L	= (( ECAN1_FILTER6_EID & 0x1F) << 11u) | (ECAN1_FILTER6_SID & 0x7FFu);;	
    /*----------------------------------------------------------------------------*/
    /* ECAN1フィルタオブジェクト6High */		
    /*----------------------------------------------------------------------------*/
        C1FLTOBJ6H	= ((ECAN1_FILTER6_EXIDE & 0x01 ) << 14u) | ((ECAN1_FILTER6_SID & 0x800u) << 2u) | (( ECAN1_FILTER6_EID >> 5u) & 0x1FFFu);	
    /*----------------------------------------------------------------------------*/
    /* ECAN1マスクレジスタ6Low */		
    /*----------------------------------------------------------------------------*/
        C1MASK6L	= (( ECAN1_MASK6_EID & 0x1F) << 11u) | (ECAN1_MASK6_SID & 0x7FFu);		
    /*----------------------------------------------------------------------------*/
    /* ECAN1マスクレジスタ6High */		
    /*----------------------------------------------------------------------------*/
        C1MASK6H	= ((ECAN1_MASK6_EXIDE & 0x01 ) << 14u) | ((ECAN1_MASK6_SID & 0x800u) << 2u) | (( ECAN1_MASK6_EID >> 5u) & 0x1FFFu);		
    /*----------------------------------------------------------------------------*/
    /* ECAN1フィルタオブジェクト7Low */	
    /*----------------------------------------------------------------------------*/
        C1FLTOBJ7L	= (( ECAN1_FILTER7_EID & 0x1F) << 11u) | (ECAN1_FILTER7_SID & 0x7FFu);;	
    /*----------------------------------------------------------------------------*/
    /* ECAN1フィルタオブジェクト7High */	
    /*----------------------------------------------------------------------------*/
        C1FLTOBJ7H	= ((ECAN1_FILTER7_EXIDE & 0x01 ) << 14u) | ((ECAN1_FILTER7_SID & 0x800u) << 2u) | (( ECAN1_FILTER7_EID >> 5u) & 0x1FFFu);	
    /*----------------------------------------------------------------------------*/
    /* ECAN1マスクレジスタ7Low */		
    /*----------------------------------------------------------------------------*/
        C1MASK7L	= (( ECAN1_MASK7_EID & 0x1F) << 11u) | (ECAN1_MASK7_SID & 0x7FFu);	
    /*----------------------------------------------------------------------------*/
    /* ECAN1マスクレジスタ7High */	
    /*----------------------------------------------------------------------------*/
        C1MASK7H	= ((ECAN1_MASK7_EXIDE & 0x01 ) << 14u) | ((ECAN1_MASK7_SID & 0x800u) << 2u) | (( ECAN1_MASK7_EID >> 5u) & 0x1FFFu);		
    /*----------------------------------------------------------------------------*/
    /* ECAN1フィルタオブジェクト8Low */	
    /*----------------------------------------------------------------------------*/
        C1FLTOBJ8L	= (( ECAN1_FILTER8_EID & 0x1F) << 11u) | (ECAN1_FILTER8_SID & 0x7FFu);;	
    /*----------------------------------------------------------------------------*/
    /* ECAN1フィルタオブジェクト8High */	
    /*----------------------------------------------------------------------------*/
        C1FLTOBJ8H	= ((ECAN1_FILTER8_EXIDE & 0x01 ) << 14u) | ((ECAN1_FILTER8_SID & 0x800u) << 2u) | (( ECAN1_FILTER8_EID >> 5u) & 0x1FFFu);		
    /*----------------------------------------------------------------------------*/
    /* ECAN1マスクレジスタ8Low */	
    /*----------------------------------------------------------------------------*/
        C1MASK8L	= (( ECAN1_MASK8_EID & 0x1F) << 11u) | (ECAN1_MASK8_SID & 0x7FFu);		
    /*----------------------------------------------------------------------------*/
    /* ECAN1マスクレジスタ8High*/		
    /*----------------------------------------------------------------------------*/
        C1MASK8H	= ((ECAN1_MASK8_EXIDE & 0x01 ) << 14u) | ((ECAN1_MASK8_SID & 0x800u) << 2u) | (( ECAN1_MASK8_EID >> 5u) & 0x1FFFu);		
    /*----------------------------------------------------------------------------*/
    /* ECAN1フィルタオブジェクト9Low */	
    /*----------------------------------------------------------------------------*/
        C1FLTOBJ9L	= (( ECAN1_FILTER9_EID & 0x1F) << 11u) | (ECAN1_FILTER9_SID & 0x7FFu);;	
    /*----------------------------------------------------------------------------*/
    /* ECAN1フィルタオブジェクト9High */		
    /*----------------------------------------------------------------------------*/
        C1FLTOBJ9H	= ((ECAN1_FILTER9_EXIDE & 0x01 ) << 14u) | ((ECAN1_FILTER9_SID & 0x800u) << 2u) | (( ECAN1_FILTER9_EID >> 5u) & 0x1FFFu);	
    /*----------------------------------------------------------------------------*/
    /* ECAN1マスクレジスタ9Low */	
    /*----------------------------------------------------------------------------*/
        C1MASK9L	= (( ECAN1_MASK9_EID & 0x1F) << 11u) | (ECAN1_MASK9_SID & 0x7FFu);	
    /*----------------------------------------------------------------------------*/
    /* ECAN1マスクレジスタ9High */		
    /*----------------------------------------------------------------------------*/
        C1MASK9H	= ((ECAN1_MASK9_EXIDE & 0x01 ) << 14u) | ((ECAN1_MASK9_SID & 0x800u) << 2u) | (( ECAN1_MASK9_EID >> 5u) & 0x1FFFu);	
    /*----------------------------------------------------------------------------*/
    /* ECAN1フィルタオブジェクト10Low */		
    /*----------------------------------------------------------------------------*/
        C1FLTOBJ10L	= (( ECAN1_FILTER10_EID & 0x1F) << 11u) | (ECAN1_FILTER10_SID & 0x7FFu);;	
    /*----------------------------------------------------------------------------*/
    /* ECAN1フィルタオブジェクト10High */		
    /*----------------------------------------------------------------------------*/
        C1FLTOBJ10H	= ((ECAN1_FILTER10_EXIDE & 0x01 ) << 14u) | ((ECAN1_FILTER10_SID & 0x800u) << 2u) | (( ECAN1_FILTER10_EID >> 5u) & 0x1FFFu);	
    /*----------------------------------------------------------------------------*/
    /* ECAN1マスクレジスタ10Low */		
    /*----------------------------------------------------------------------------*/
        C1MASK10L	= (( ECAN1_MASK10_EID & 0x1F) << 11u) | (ECAN1_MASK10_SID & 0x7FFu);	
    /*----------------------------------------------------------------------------*/
    /* ECAN1マスクレジスタ10High */	
    /*----------------------------------------------------------------------------*/
        C1MASK10H	= ((ECAN1_MASK10_EXIDE & 0x01 ) << 14u) | ((ECAN1_MASK10_SID & 0x800u) << 2u) | (( ECAN1_MASK10_EID >> 5u) & 0x1FFFu);	
    /*----------------------------------------------------------------------------*/
    /* ECAN1フィルタオブジェクト11Low */	
    /*----------------------------------------------------------------------------*/
        C1FLTOBJ11L	= (( ECAN1_FILTER11_EID & 0x1F) << 11u) | (ECAN1_FILTER11_SID & 0x7FFu);;	
    /*----------------------------------------------------------------------------*/
    /* ECAN1フィルタオブジェクト11High */		
    /*----------------------------------------------------------------------------*/
        C1FLTOBJ11H	= ((ECAN1_FILTER11_EXIDE & 0x01 ) << 14u) | ((ECAN1_FILTER11_SID & 0x800u) << 2u) | (( ECAN1_FILTER11_EID >> 5u) & 0x1FFFu);	
    /*----------------------------------------------------------------------------*/
    /* ECAN1マスクレジスタ11Low */	
    /*----------------------------------------------------------------------------*/
        C1MASK11L	= (( ECAN1_MASK11_EID & 0x1F) << 11u) | (ECAN1_MASK11_SID & 0x7FFu);	
    /*----------------------------------------------------------------------------*/
    /* ECAN1マスクレジスタ11High */		
    /*----------------------------------------------------------------------------*/
        C1MASK11H	= ((ECAN1_MASK11_EXIDE & 0x01 ) << 14u) | ((ECAN1_MASK11_SID & 0x800u) << 2u) | (( ECAN1_MASK11_EID >> 5u) & 0x1FFFu);	
    /*----------------------------------------------------------------------------*/
    /* ECAN1フィルタオブジェクト12Low */		
    /*----------------------------------------------------------------------------*/
        C1FLTOBJ12L	= (( ECAN1_FILTER12_EID & 0x1F) << 11u) | (ECAN1_FILTER12_SID & 0x7FFu);;	
    /*----------------------------------------------------------------------------*/
    /* ECAN1フィルタオブジェクト12High */		
    /*----------------------------------------------------------------------------*/
        C1FLTOBJ12H	= ((ECAN1_FILTER12_EXIDE & 0x01 ) << 14u) | ((ECAN1_FILTER12_SID & 0x800u) << 2u) | (( ECAN1_FILTER12_EID >> 5u) & 0x1FFFu);		
    /*----------------------------------------------------------------------------*/
    /* ECAN1マスクレジスタ12Low */	
    /*----------------------------------------------------------------------------*/
        C1MASK12L	= (( ECAN1_MASK12_EID & 0x1F) << 11u) | (ECAN1_MASK12_SID & 0x7FFu);	
    /*----------------------------------------------------------------------------*/
    /* ECAN1マスクレジスタ12High */
    /*----------------------------------------------------------------------------*/
        C1MASK12H	= ((ECAN1_MASK12_EXIDE & 0x01 ) << 14u) | ((ECAN1_MASK12_SID & 0x800u) << 2u) | (( ECAN1_MASK12_EID >> 5u) & 0x1FFFu);	
    /*----------------------------------------------------------------------------*/
    /* ECAN1フィルタオブジェクト13Low */		
    /*----------------------------------------------------------------------------*/
        C1FLTOBJ13L	= (( ECAN1_FILTER13_EID & 0x1F) << 11u) | (ECAN1_FILTER13_SID & 0x7FFu);;	
    /*----------------------------------------------------------------------------*/
    /* ECAN1フィルタオブジェクト13High */		
    /*----------------------------------------------------------------------------*/
        C1FLTOBJ13H	= ((ECAN1_FILTER13_EXIDE & 0x01 ) << 14u) | ((ECAN1_FILTER13_SID & 0x800u) << 2u) | (( ECAN1_FILTER13_EID >> 5u) & 0x1FFFu);		
    /*----------------------------------------------------------------------------*/
    /* ECAN1マスクレジスタ13Low */	
    /*----------------------------------------------------------------------------*/
        C1MASK13L	= (( ECAN1_MASK13_EID & 0x1F) << 11u) | (ECAN1_MASK13_SID & 0x7FFu);	
    /*----------------------------------------------------------------------------*/
    /* ECAN1マスクレジスタ13High */	
    /*----------------------------------------------------------------------------*/
        C1MASK13H	= ((ECAN1_MASK13_EXIDE & 0x01 ) << 14u) | ((ECAN1_MASK13_SID & 0x800u) << 2u) | (( ECAN1_MASK13_EID >> 5u) & 0x1FFFu);		
    /*----------------------------------------------------------------------------*/
    /* ECAN1フィルタオブジェクト14Low */
    /*----------------------------------------------------------------------------*/
        C1FLTOBJ14L	= (( ECAN1_FILTER14_EID & 0x1F) << 11u) | (ECAN1_FILTER14_SID & 0x7FFu);;	
    /*----------------------------------------------------------------------------*/
    /* ECAN1フィルタオブジェクト14High */		
    /*----------------------------------------------------------------------------*/
        C1FLTOBJ14H	= ((ECAN1_FILTER14_EXIDE & 0x01 ) << 14u) | ((ECAN1_FILTER14_SID & 0x800u) << 2u) | (( ECAN1_FILTER14_EID >> 5u) & 0x1FFFu);	
    /*----------------------------------------------------------------------------*/
    /* ECAN1マスクレジスタ14Low */
    /*----------------------------------------------------------------------------*/
        C1MASK14L	= (( ECAN1_MASK14_EID & 0x1F) << 11u) | (ECAN1_MASK14_SID & 0x7FFu);	
    /*----------------------------------------------------------------------------*/
    /* ECAN1マスクレジスタ14High */		
    /*----------------------------------------------------------------------------*/
        C1MASK14H	= ((ECAN1_MASK14_EXIDE & 0x01 ) << 14u) | ((ECAN1_MASK14_SID & 0x800u) << 2u) | (( ECAN1_MASK14_EID >> 5u) & 0x1FFFu);	
    /*----------------------------------------------------------------------------*/
    /* ECAN1フィルタオブジェクト15Low */	
    /*----------------------------------------------------------------------------*/
        C1FLTOBJ15L	= (( ECAN1_FILTER15_EID & 0x1F) << 11u) | (ECAN1_FILTER15_SID & 0x7FFu);;		
    /*----------------------------------------------------------------------------*/
    /* ECAN1フィルタオブジェクト15High */		
    /*----------------------------------------------------------------------------*/
        C1FLTOBJ15H	= ((ECAN1_FILTER15_EXIDE & 0x01 ) << 14u) | ((ECAN1_FILTER15_SID & 0x800u) << 2u) | (( ECAN1_FILTER15_EID >> 5u) & 0x1FFFu);	
    /*----------------------------------------------------------------------------*/
    /* ECAN1マスクレジスタ15Low */		
    /*----------------------------------------------------------------------------*/
        C1MASK15L	= (( ECAN1_MASK15_EID & 0x1F) << 11u) | (ECAN1_MASK15_SID & 0x7FFu);	
    /*----------------------------------------------------------------------------*/
    /* ECAN1マスクレジスタ15High */	
    /*----------------------------------------------------------------------------*/
        C1MASK15H	= ((ECAN1_MASK15_EXIDE & 0x01 ) << 14u) | ((ECAN1_MASK15_SID & 0x800u) << 2u) | (( ECAN1_MASK15_EID >> 5u) & 0x1FFFu);	  
        
        return (ECAN1_DRV_RET_OK);
}

/*----------------------------------------------------------------------------*/
/*
* @fn        u2g_ECAN1_Set_Filter(_u2 u2a_FilterID,_u2 u2a_SID,_u4 u4a_EID,_u2 u2a_EXIDE)
* @brief     フィルタレジスタを初期化します 
* @param      u2a_FilterID：フィルタID(0～15)
* @param      u2a_SID：SID(0～0xFFF)
* @param      u2a_EID：EID(0～0x3FFFF)
* @param      u2a_EXIDE：フィルタID(0 or 1)
* @return     ECAN1_DRV_RET
* @detail 
*/
/*----------------------------------------------------------------------------*/
ECAN1_DRV_RET u2g_ECAN1_Set_Filter(_u2 u2a_FilterID,_u2 u2a_SID,_u4 u4a_EID,_u2 u2a_EXIDE)
{
    /*----------------------------------------------------------------------------*/
    /*【****】引数チェック*/
    /*----------------------------------------------------------------------------*/
        if (u2a_SID > 0xFFFu)
        {
            return ECAN1_DRV_RET_INVARID_INPUT;
        }
        if (u4a_EID > 0x3FFFFu){return (ECAN1_DRV_RET_INVARID_INPUT);}
        if (u2a_EXIDE > 1u){return (ECAN1_DRV_RET_INVARID_INPUT);}
    /*----------------------------------------------------------------------------*/
    /*【****】フィルター値代入*/
    /*----------------------------------------------------------------------------*/
        switch (u2a_FilterID)
        {
            case 0:
                C1FLTOBJ0L = (((_u2)(u4a_EID & 0x1Fu) << 11u) | (u2a_SID & 0x7FFu));
                C1FLTOBJ0H = ((u4a_EID >> 5u) & 0x1FFF) | ((u2a_SID & 0x800) << 2u) | (u2a_EXIDE << 14u);
                break;
            case 1:
                C1FLTOBJ1L = (((_u2)(u4a_EID & 0x1Fu) << 11u) | (u2a_SID & 0x7FFu));
                C1FLTOBJ1H = ((u4a_EID >> 5u) & 0x1FFF) | ((u2a_SID & 0x800) << 2u) | (u2a_EXIDE << 14u);
                break;    
            case 2:
                C1FLTOBJ2L = (((_u2)(u4a_EID & 0x1Fu) << 11u) | (u2a_SID & 0x7FFu));
                C1FLTOBJ2H = ((u4a_EID >> 5u) & 0x1FFF) | ((u2a_SID & 0x800) << 2u) | (u2a_EXIDE << 14u);
                break;
            case 3:
                C1FLTOBJ3L = (((_u2)(u4a_EID & 0x1Fu) << 11u) | (u2a_SID & 0x7FFu));
                C1FLTOBJ3H = ((u4a_EID >> 5u) & 0x1FFF) | ((u2a_SID & 0x800) << 2u) | (u2a_EXIDE << 14u);
                break;    
            case 4:
                C1FLTOBJ4L = (((_u2)(u4a_EID & 0x1Fu) << 11u) | (u2a_SID & 0x7FFu));
                C1FLTOBJ4H = ((u4a_EID >> 5u) & 0x1FFF) | ((u2a_SID & 0x800) << 2u) | (u2a_EXIDE << 14u);
                break;
            case 5:
                C1FLTOBJ5L = (((_u2)(u4a_EID & 0x1Fu) << 11u) | (u2a_SID & 0x7FFu));
                C1FLTOBJ5H = ((u4a_EID >> 5u) & 0x1FFF) | ((u2a_SID & 0x800) << 2u) | (u2a_EXIDE << 14u);
                break;    
            case 6:
                C1FLTOBJ6L = (((_u2)(u4a_EID & 0x1Fu) << 11u) | (u2a_SID & 0x7FFu));
                C1FLTOBJ6H = ((u4a_EID >> 5u) & 0x1FFF) | ((u2a_SID & 0x800) << 2u) | (u2a_EXIDE << 14u);
                break;  
            case 7:
                C1FLTOBJ7L = (((_u2)(u4a_EID & 0x1Fu) << 11u) | (u2a_SID & 0x7FFu));
                C1FLTOBJ7H = ((u4a_EID >> 5u) & 0x1FFF) | ((u2a_SID & 0x800) << 2u) | (u2a_EXIDE << 14u);
                break;
            case 8:
                C1FLTOBJ8L = (((_u2)(u4a_EID & 0x1Fu) << 11u) | (u2a_SID & 0x7FFu));
                C1FLTOBJ8H = ((u4a_EID >> 5u) & 0x1FFF) | ((u2a_SID & 0x800) << 2u) | (u2a_EXIDE << 14u);
                break;    
            case 9:
                C1FLTOBJ9L = (((_u2)(u4a_EID & 0x1Fu) << 11u) | (u2a_SID & 0x7FFu));
                C1FLTOBJ9H = ((u4a_EID >> 5u) & 0x1FFF) | ((u2a_SID & 0x800) << 2u) | (u2a_EXIDE << 14u);
                break;
            case 10:
                C1FLTOBJ10L = (((_u2)(u4a_EID & 0x1Fu) << 11u) | (u2a_SID & 0x7FFu));
                C1FLTOBJ10H = ((u4a_EID >> 5u) & 0x1FFF) | ((u2a_SID & 0x800) << 2u) | (u2a_EXIDE << 14u);
                break;    
            case 11:
                C1FLTOBJ11L = (((_u2)(u4a_EID & 0x1Fu) << 11u) | (u2a_SID & 0x7FFu));
                C1FLTOBJ11H = ((u4a_EID >> 5u) & 0x1FFF) | ((u2a_SID & 0x800) << 2u) | (u2a_EXIDE << 14u);
                break;
            case 12:
                C1FLTOBJ12L = (((_u2)(u4a_EID & 0x1Fu) << 11u) | (u2a_SID & 0x7FFu));
                C1FLTOBJ12H = ((u4a_EID >> 5u) & 0x1FFF) | ((u2a_SID & 0x800) << 2u) | (u2a_EXIDE << 14u);
                break;    
            case 13:
                C1FLTOBJ13L = (((_u2)(u4a_EID & 0x1Fu) << 11u) | (u2a_SID & 0x7FFu));
                C1FLTOBJ13H = ((u4a_EID >> 5u) & 0x1FFF) | ((u2a_SID & 0x800) << 2u) | (u2a_EXIDE << 14u);
                break;
            case 14:
                C1FLTOBJ14L = (((_u2)(u4a_EID & 0x1Fu) << 11u) | (u2a_SID & 0x7FFu));
                C1FLTOBJ14H = ((u4a_EID >> 5u) & 0x1FFF) | ((u2a_SID & 0x800) << 2u) | (u2a_EXIDE << 14u);
                break;   
            case 15:
                C1FLTOBJ15L = (((_u2)(u4a_EID & 0x1Fu) << 11u) | (u2a_SID & 0x7FFu));
                C1FLTOBJ15H = ((u4a_EID >> 5u) & 0x1FFF) | ((u2a_SID & 0x800) << 2u) | (u2a_EXIDE << 14u);
                break; 
            default:
                return (ECAN1_DRV_RET_INVARID_INPUT);
                break;
        }
        
        return (ECAN1_DRV_RET_OK);
}

/*----------------------------------------------------------------------------*/
/*
* @fn        u2g_ECAN1_Set_Mask(_u2 u2a_FilterID,_u2 u2a_SID,_u4 u4a_EID,_u2 u2a_EXIDE)
* @brief        マスクレジスタを初期化します
* @param           u2a_FilterID：フィルタID(0～15)
* @param           u2a_SID：SID(0～0xFFF)
* @param           u2a_EID：EID(0～0x3FFFF)
* @param           u2a_EXIDE：フィルタID(0 or 1)
* @return         ECAN1_DRV_RET
* @detail 
*/
/*----------------------------------------------------------------------------*/
ECAN1_DRV_RET u2g_ECAN1_Set_Mask(_u2 u2a_FilterID,_u2 u2a_SID,_u4 u4a_EID,_u2 u2a_EXIDE)
{
    /*----------------------------------------------------------------------------*/
    /*【****】引数チェック*/
    /*----------------------------------------------------------------------------*/
        if (u2a_SID > 0xFFFu){return (ECAN1_DRV_RET_INVARID_INPUT);}
        if (u4a_EID > 0x3FFFFu){return (ECAN1_DRV_RET_INVARID_INPUT);}
        if (u2a_EXIDE > 1u){return (ECAN1_DRV_RET_INVARID_INPUT);}
    /*----------------------------------------------------------------------------*/
    /*【****】マスク値代入*/
    /*----------------------------------------------------------------------------*/
        switch (u2a_FilterID)
        {
            case 0:
                C1FLTOBJ0L = (((_u2)(u4a_EID & 0x1Fu) << 11u) | (u2a_SID & 0x7FFu));
                C1FLTOBJ0H = ((u4a_EID >> 5u) & 0x1FFF) | ((u2a_SID & 0x800) << 2u) | (u2a_EXIDE << 14u);
                break;
            case 1:
                C1FLTOBJ1L = (((_u2)(u4a_EID & 0x1Fu) << 11u) | (u2a_SID & 0x7FFu));
                C1FLTOBJ1H = ((u4a_EID >> 5u) & 0x1FFF) | ((u2a_SID & 0x800) << 2u) | (u2a_EXIDE << 14u);
                break;    
            case 2:
                C1FLTOBJ2L = (((_u2)(u4a_EID & 0x1Fu) << 11u) | (u2a_SID & 0x7FFu));
                C1FLTOBJ2H = ((u4a_EID >> 5u) & 0x1FFF) | ((u2a_SID & 0x800) << 2u) | (u2a_EXIDE << 14u);
                break;
            case 3:
                C1FLTOBJ3L = (((_u2)(u4a_EID & 0x1Fu) << 11u) | (u2a_SID & 0x7FFu));
                C1FLTOBJ3H = ((u4a_EID >> 5u) & 0x1FFF) | ((u2a_SID & 0x800) << 2u) | (u2a_EXIDE << 14u);
                break;    
            case 4:
                C1FLTOBJ4L = (((_u2)(u4a_EID & 0x1Fu) << 11u) | (u2a_SID & 0x7FFu));
                C1FLTOBJ4H = ((u4a_EID >> 5u) & 0x1FFF) | ((u2a_SID & 0x800) << 2u) | (u2a_EXIDE << 14u);
                break;
            case 5:
                C1FLTOBJ5L = (((_u2)(u4a_EID & 0x1Fu) << 11u) | (u2a_SID & 0x7FFu));
                C1FLTOBJ5H = ((u4a_EID >> 5u) & 0x1FFF) | ((u2a_SID & 0x800) << 2u) | (u2a_EXIDE << 14u);
                break;    
            case 6:
                C1FLTOBJ6L = (((_u2)(u4a_EID & 0x1Fu) << 11u) | (u2a_SID & 0x7FFu));
                C1FLTOBJ6H = ((u4a_EID >> 5u) & 0x1FFF) | ((u2a_SID & 0x800) << 2u) | (u2a_EXIDE << 14u);
                break;  
            case 7:
                C1FLTOBJ7L = (((_u2)(u4a_EID & 0x1Fu) << 11u) | (u2a_SID & 0x7FFu));
                C1FLTOBJ7H = ((u4a_EID >> 5u) & 0x1FFF) | ((u2a_SID & 0x800) << 2u) | (u2a_EXIDE << 14u);
                break;
            case 8:
                C1FLTOBJ8L = (((_u2)(u4a_EID & 0x1Fu) << 11u) | (u2a_SID & 0x7FFu));
                C1FLTOBJ8H = ((u4a_EID >> 5u) & 0x1FFF) | ((u2a_SID & 0x800) << 2u) | (u2a_EXIDE << 14u);
                break;    
            case 9:
                C1FLTOBJ9L = (((_u2)(u4a_EID & 0x1Fu) << 11u) | (u2a_SID & 0x7FFu));
                C1FLTOBJ9H = ((u4a_EID >> 5u) & 0x1FFF) | ((u2a_SID & 0x800) << 2u) | (u2a_EXIDE << 14u);
                break;
            case 10:
                C1FLTOBJ10L = (((_u2)(u4a_EID & 0x1Fu) << 11u) | (u2a_SID & 0x7FFu));
                C1FLTOBJ10H = ((u4a_EID >> 5u) & 0x1FFF) | ((u2a_SID & 0x800) << 2u) | (u2a_EXIDE << 14u);
                break;    
            case 11:
                C1FLTOBJ11L = (((_u2)(u4a_EID & 0x1Fu) << 11u) | (u2a_SID & 0x7FFu));
                C1FLTOBJ11H = ((u4a_EID >> 5u) & 0x1FFF) | ((u2a_SID & 0x800) << 2u) | (u2a_EXIDE << 14u);
                break;
            case 12:
                C1FLTOBJ12L = (((_u2)(u4a_EID & 0x1Fu) << 11u) | (u2a_SID & 0x7FFu));
                C1FLTOBJ12H = ((u4a_EID >> 5u) & 0x1FFF) | ((u2a_SID & 0x800) << 2u) | (u2a_EXIDE << 14u);
                break;    
            case 13:
                C1FLTOBJ13L = (((_u2)(u4a_EID & 0x1Fu) << 11u) | (u2a_SID & 0x7FFu));
                C1FLTOBJ13H = ((u4a_EID >> 5u) & 0x1FFF) | ((u2a_SID & 0x800) << 2u) | (u2a_EXIDE << 14u);
                break;
            case 14:
                C1FLTOBJ14L = (((_u2)(u4a_EID & 0x1Fu) << 11u) | (u2a_SID & 0x7FFu));
                C1FLTOBJ14H = ((u4a_EID >> 5u) & 0x1FFF) | ((u2a_SID & 0x800) << 2u) | (u2a_EXIDE << 14u);
                break;   
            case 15:
                C1FLTOBJ15L = (((_u2)(u4a_EID & 0x1Fu) << 11u) | (u2a_SID & 0x7FFu));
                C1FLTOBJ15H = ((u4a_EID >> 5u) & 0x1FFF) | ((u2a_SID & 0x800) << 2u) | (u2a_EXIDE << 14u);
                break; 
            default:
                return (ECAN1_DRV_RET_INVARID_INPUT);
                break;
        }
        
        return (ECAN1_DRV_RET_OK);
}


/*----------------------------------------------------------------------------*/
/*
* @fn        vdg_ECAN1_Set_Register(void) 
* @brief        ECAN1レジスタを初期化します 
* @param
* @return
* @detail
*/
/*----------------------------------------------------------------------------*/
void vdg_ECAN1_Init_Register(void)
{
    /*----------------------------------------------------------------------------*/
    /* モジュールの有効化 */
    /*----------------------------------------------------------------------------*/
        PMD1bits.C1MD	= PMD_CAN1MD;   /* CANモジュール無効化ビット */
        C1CONLbits.CON = 1u;
    /*----------------------------------------------------------------------------*/
    /* コンフィグレーションモードに移行 */
    /*----------------------------------------------------------------------------*/
        C1CONHbits.REQOP = 4u;
        while(C1CONHbits.OPMOD != 4u);
    /*----------------------------------------------------------------------------*/
    /* 送受信バッファの設定 */
    /*----------------------------------------------------------------------------*/
        C1FIFOBAL = (unsigned int) &CanMessageBuffer;
    /*----------------------------------------------------------------------------*/
    /* CANFDモジュールを1Mbpsの公称ビットレート速度と2Mbpsのデータビット速度に設定します。 */
    /*----------------------------------------------------------------------------*/
        /* Set up the CANFD module for 1Mbps of Nominal bit rate speed and 2Mbps of Data bit rate. */
#if 0 
        C1NBTCFGH = 0x003E;
        C1NBTCFGL = 0x0F0F;
        C1DBTCFGH = 0x001E;
        C1DBTCFGL = 0x0707;
        C1TDCH = 0x0002; //TDCMOD is Auto
        C1TDCL = 0x1F00;
#else
        C1NBTCFGHbits.BRP = 1u;         /* TQ = 2/FSYS*/
        C1NBTCFGHbits.TSEG1 = 142u;     /* TSEG1 = 143TQ */
        C1NBTCFGLbits.TSEG2 = 35u;      /* TESG2 = 36TQ */
        C1NBTCFGLbits.SJW = 35u;        /* SJW = 36TQ */
        C1TDCH = 0x0002;                //TDCMOD is Auto
        C1TDCL = 0x1F00;
#endif
    /*----------------------------------------------------------------------------*/
    /*【****】送信キューとBRSを有効にするようにCANFDモジュールを設定します*/
    /*----------------------------------------------------------------------------*/    
        /* Configure CANFD module to enable Transmit Queue and BRS*/
#if (ECAN1_FRAME_MODE == ECAN1_FRAME_20)
        C1CONLbits.BRSDIS = 0x1u;
#else
        C1CONLbits.BRSDIS = 0x0u;
#endif
        C1CONHbits.STEF = 0x0; //Don't save transmitted messages in TEF
        C1CONHbits.TXQEN = 0x1;
    /*----------------------------------------------------------------------------*/
    /*【****】TXQ設定*/
    /*----------------------------------------------------------------------------*/    
        /* Configure TXQ to transmit 1 message*/
        C1TXQCONHbits.FSIZE = ECAN1_TXQ_DEEP - 1u; // single message
        C1TXQCONHbits.PLSIZE = ECAN1_PAYLOAD_8BYTE; // 8 bytes of data
    /*----------------------------------------------------------------------------*/
    /*【****】FIFO1設定(送信)*/
    /*----------------------------------------------------------------------------*/    
        /* Configure FIFO1 to transmit 2 messages*/
        C1FIFOCON1Hbits.FSIZE = ECAN1_FIFO_DEEP - 1u; //2 messages
        C1FIFOCON1Hbits.PLSIZE = ECAN1_PAYLOAD_8BYTE; //8 bytes of data
        C1FIFOCON1Lbits.TXEN = 0x0; // Set TXEN bit ,transmit fifo
    /*----------------------------------------------------------------------------*/
    /*【****】FIFO2設定(受信)*/
    /*----------------------------------------------------------------------------*/    
        C1FIFOCON1Hbits.FSIZE = ECAN1_FIFO_DEEP - 1u; //2 messages
        C1FIFOCON1Hbits.PLSIZE = ECAN1_PAYLOAD_8BYTE; //64 bytes of data
        C1FIFOCON1Lbits.TXEN = 0x0; // Set TXEN bit ,transmit fifo
        
    /*----------------------------------------------------------------------------*/
    /*【****】Filter設定*/
    /*----------------------------------------------------------------------------*/ 
        u2g_ECAN1_Init_FilterObj();
        u2g_ECAN1_Init_FilterCon();
        
    /*----------------------------------------------------------------------------*/
    /* ノーマルモードに移行 */
    /*----------------------------------------------------------------------------*/
        C1CONHbits.REQOP = 0;
        while(C1CONHbits.OPMOD != 0); 
}

/*----------------------------------------------------------------------------*/
/*
* @fn        vdg_ECAN1_SendTest_TXQ(void)
* @brief     TXQでの送信テスト
* @param
* @return
* @detail 
*/
/*----------------------------------------------------------------------------*/
void vdg_ECAN1_SendTest_TXQ(void)
{
    /*----------------------------------------------------------------------------*/
    /*【****】ローカル変数の定義と初期化*/
    /*----------------------------------------------------------------------------*/
        _u2 u2l_Index;

        CANFD_TX_MSGOBJ *txObj;
    /*----------------------------------------------------------------------------*/
    /*【****】送信オブジェクトの設定*/
    /*----------------------------------------------------------------------------*/    
        /* Transmit message from TXQ - CANFD base frame with BRS*/
        /* SID = 0x100, 64 bytes of data */

        txObj = (CANFD_TX_MSGOBJ *)C1TXQUAL;
        txObj->bF.id.Hi = 0x100;
    //    txObj->bF.id.SID = 0x100;
    //    txObj->bF.id.EID = 0x0000;
        txObj->bF.ctrl.BRS = 1 ;        //Switch bit rate
        txObj->bF.ctrl.DLC = 0xF;       //64 bytes
        txObj->bF.ctrl.FDF = 1;         // CANFD frame
        txObj->bF.ctrl.IDE = 0;         //Standard frame
    /*----------------------------------------------------------------------------*/
    /*【****】送信(ダミー)データのセット*/
    /*----------------------------------------------------------------------------*/
        for (u2l_Index = 0;u2l_Index < 0x40;u2l_Index ++ )
        {
            txObj->byte[u2l_Index + 8] = 0x5A ; // 64 bytes of 0x5A
        }
    /*----------------------------------------------------------------------------*/
    /*【****】送信*/
    /*----------------------------------------------------------------------------*/       
        C1TXQCONLbits.UINC = 1; // Set UINC bit
        C1TXQCONLbits.TXREQ = 1; // Set TXREQ bit
}

/*----------------------------------------------------------------------------*/
/*
* @fn        vdg_ECAN1_SendTest_Fifo(void) 
* @brief        Fifoでの送信テスト
* @param
* @return
* @detail 
*/
/*----------------------------------------------------------------------------*/
void vdg_ECAN1_SendTest_Fifo(void)
{
    /*----------------------------------------------------------------------------*/
    /*【****】ローカル変数の定義と初期化*/
    /*----------------------------------------------------------------------------*/
        _u2 u2l_Index;

        CANFD_TX_MSGOBJ *txObj;
    /*----------------------------------------------------------------------------*/
    /*【****】送信オブジェクトの設定*/
    /*----------------------------------------------------------------------------*/    
        /* Transmit message from TXQ - CANFD base frame with BRS*/
        /* SID = 0x300 , 16 bytes of data */
        txObj = (CANFD_TX_MSGOBJ *)C1FIFOUA1L;
        
        txObj->bF.id.Hi = 0x300;
//        txObj->bF.id.SID = 0x300;
//        txObj->bF.id.EID = 0x0000;
        txObj->bF.ctrl.BRS = 1 ; //Switch bit rate
        txObj->bF.ctrl.DLC = 0xA; //16 bytes
        txObj->bF.ctrl.FDF = 1; // CANFD frame
        txObj->bF.ctrl.IDE = 0; //Standard frame
    /*----------------------------------------------------------------------------*/
    /*【****】送信(ダミー)データのセット*/
    /*----------------------------------------------------------------------------*/
        for (u2l_Index = 0;u2l_Index < 0x10;u2l_Index ++ )
        {
            txObj->byte[u2l_Index + 8] = 0xA5 ; // 16 bytes of 0xA5
        }
    /*----------------------------------------------------------------------------*/
    /*【****】送信*/
    /*----------------------------------------------------------------------------*/       
        C1FIFOCON1Lbits.UINC = 1; // Set UINC bit
        C1FIFOCON1Lbits.TXREQ = 1; // Set TXREQ bit
        
    /*----------------------------------------------------------------------------*/
    /*【****】送信オブジェクトの設定*/
    /*----------------------------------------------------------------------------*/    
        /* SID = 0x500, EID = 0xC000, 12 bytes of data */
        txObj = (CANFD_TX_MSGOBJ *)C1FIFOUA1L;
        txObj->bF.id.Hi = 0x500;
//        txObj->bF.id.SID = 0x500;
//        txObj->bF.id.EID = 0xC000;
        txObj->bF.ctrl.BRS = 1 ; //Switch bit rate
        txObj->bF.ctrl.DLC = 0x9; //12 bytes
        txObj->bF.ctrl.FDF = 1; // CANFD frame
        txObj->bF.ctrl.IDE = 0; //Standard frame
    /*----------------------------------------------------------------------------*/
    /*【****】送信(ダミー)データのセット*/
    /*----------------------------------------------------------------------------*/
        for (u2l_Index = 0;u2l_Index < 0xC;u2l_Index ++ )
        {
            txObj->byte[u2l_Index + 8] = 0x55 ; // 12 bytes of 0x55
        }
    /*----------------------------------------------------------------------------*/
    /*【****】送信*/
    /*----------------------------------------------------------------------------*/       
        C1FIFOCON1Lbits.UINC = 1; // Set UINC bit
        C1FIFOCON1Lbits.TXREQ = 1; // Set TXREQ bit
        
}

/*----------------------------------------------------------------------------*/
/*
* @fn        vdg_ECAN1_SendTest_Fifo(void)
* @brief        Fifoでの送信テスト
* @param
* @return
* @detail    CAN受信割り込みもしくは定期イベントでコール 
*/
/*----------------------------------------------------------------------------*/
void vdg_ECAN1_RecieveTest_Fifo(void)
{
    /*----------------------------------------------------------------------------*/
    /*【****】ローカル変数の定義と初期化*/
    /*----------------------------------------------------------------------------*/
        CANFD_RX_MSGOBJ *rxObj;
    /*----------------------------------------------------------------------------*/
    /*【****】FIFO1受信*/
    /*----------------------------------------------------------------------------*/
#if ( ECAN1_FILTER0_ENABLE == ECAN1_FILTER_ENABLE)
        if (C1FIFOSTA1bits.TFNRFNIF == 1u)
        {
            rxObj = (CANFD_RX_MSGOBJ *)C1FIFOUA1L;
            s_FIFO[1u].u2_SID = rxObj->bF.id.SID ;
            s_FIFO[1u].u2_DLC = rxObj->bF.ctrl.DLC;
            s_FIFO[1u].u4_TimeStamp = rxObj->bF.timeStamp;
            
            s_FIFO[1u].u2_Data[0u] = rxObj->word[0u];
            s_FIFO[1u].u2_Data[1u] = rxObj->word[1u];
            s_FIFO[1u].u2_Data[2u] = rxObj->word[2u];
            s_FIFO[1u].u2_Data[3u] = rxObj->word[3u];
            
            s_FIFO[1u].u2_DataUpDate = 1u;
            C1FIFOCON1Lbits.UINC = 1u; // Update the FIFO message pointer.
        }
#endif
    /*----------------------------------------------------------------------------*/
    /*【****】FIFO2受信*/
    /*----------------------------------------------------------------------------*/
#if ( ECAN1_FILTER1_ENABLE == ECAN1_FILTER_ENABLE)
        if (C1FIFOSTA2bits.TFNRFNIF == 1u)
        {
            rxObj = (CANFD_RX_MSGOBJ *)C1FIFOUA2L;
            s_FIFO[1u].u2_SID = rxObj->bF.id.SID ;
            s_FIFO[1u].u2_DLC = rxObj->bF.ctrl.DLC;
            s_FIFO[1u].u4_TimeStamp = rxObj->bF.timeStamp;
            
            s_FIFO[1u].u2_Data[0u] = rxObj->word[0u];
            s_FIFO[1u].u2_Data[1u] = rxObj->word[1u];
            s_FIFO[1u].u2_Data[2u] = rxObj->word[2u];
            s_FIFO[1u].u2_Data[3u] = rxObj->word[3u];
            
            s_FIFO[1u].u2_DataUpDate = 1u;
            C1FIFOCON2Lbits.UINC = 1u; // Update the FIFO message pointer.
        }
#endif
    /*----------------------------------------------------------------------------*/
    /*【****】FIFO3受信*/
    /*----------------------------------------------------------------------------*/
#if ( ECAN1_FILTER2_ENABLE == ECAN1_FILTER_ENABLE)
        if (C1FIFOSTA3bits.TFNRFNIF == 1u)
        {
            rxObj = (CANFD_RX_MSGOBJ *)C1FIFOUA3L;
            s_FIFO[2u].u2_SID = rxObj->bF.id.SID ;
            s_FIFO[2u].u2_DLC = rxObj->bF.ctrl.DLC;
            s_FIFO[2u].u4_TimeStamp = rxObj->bF.timeStamp;
            
            s_FIFO[2u].u2_Data[0u] = rxObj->word[0u];
            s_FIFO[2u].u2_Data[1u] = rxObj->word[1u];
            s_FIFO[2u].u2_Data[2u] = rxObj->word[2u];
            s_FIFO[2u].u2_Data[3u] = rxObj->word[3u];
            
            s_FIFO[2u].u2_DataUpDate = 1u;
            C1FIFOCON3Lbits.UINC = 1u; // Update the FIFO message pointer.
        }  
#endif
    /*----------------------------------------------------------------------------*/
    /*【****】FIFO4受信*/
    /*----------------------------------------------------------------------------*/
#if ( ECAN1_FILTER3_ENABLE == ECAN1_FILTER_ENABLE)
        if (C1FIFOSTA4bits.TFNRFNIF == 1u)
        {
            rxObj = (CANFD_RX_MSGOBJ *)C1FIFOUA4L;
            s_FIFO[3u].u2_SID = rxObj->bF.id.SID ;
            s_FIFO[3u].u2_DLC = rxObj->bF.ctrl.DLC;
            s_FIFO[3u].u4_TimeStamp = rxObj->bF.timeStamp;
            
            s_FIFO[3u].u2_Data[0u] = rxObj->word[0u];
            s_FIFO[3u].u2_Data[1u] = rxObj->word[1u];
            s_FIFO[3u].u2_Data[2u] = rxObj->word[2u];
            s_FIFO[3u].u2_Data[3u] = rxObj->word[3u];
            
            s_FIFO[3u].u2_DataUpDate = 1u;
            C1FIFOCON4Lbits.UINC = 1u; // Update the FIFO message pointer.
        }  
#endif
    /*----------------------------------------------------------------------------*/
    /*【****】FIFO5受信*/
    /*----------------------------------------------------------------------------*/
#if ( ECAN1_FILTER4_ENABLE == ECAN1_FILTER_ENABLE)
        if (C1FIFOSTA5bits.TFNRFNIF == 1u)
        {
            rxObj = (CANFD_RX_MSGOBJ *)C1FIFOUA5L;
            s_FIFO[4u].u2_SID = rxObj->bF.id.SID ;
            s_FIFO[4u].u2_DLC = rxObj->bF.ctrl.DLC;
            s_FIFO[4u].u4_TimeStamp = rxObj->bF.timeStamp;
            
            s_FIFO[4u].u2_Data[0u] = rxObj->word[0u];
            s_FIFO[4u].u2_Data[1u] = rxObj->word[1u];
            s_FIFO[4u].u2_Data[2u] = rxObj->word[2u];
            s_FIFO[4u].u2_Data[3u] = rxObj->word[3u];
            
            s_FIFO[4u].u2_DataUpDate = 1u;
            C1FIFOCON5Lbits.UINC = 1u; // Update the FIFO message pointer.
        }
#endif
    /*----------------------------------------------------------------------------*/
    /*【****】FIFO6受信*/
    /*----------------------------------------------------------------------------*/
#if ( ECAN1_FILTER5_ENABLE == ECAN1_FILTER_ENABLE)
        if (C1FIFOSTA6bits.TFNRFNIF == 1u)
        {
            rxObj = (CANFD_RX_MSGOBJ *)C1FIFOUA6L;
            s_FIFO[5u].u2_SID = rxObj->bF.id.SID ;
            s_FIFO[5u].u2_DLC = rxObj->bF.ctrl.DLC;
            s_FIFO[5u].u4_TimeStamp = rxObj->bF.timeStamp;
            
            s_FIFO[5u].u2_Data[0u] = rxObj->word[0u];
            s_FIFO[5u].u2_Data[1u] = rxObj->word[1u];
            s_FIFO[5u].u2_Data[2u] = rxObj->word[2u];
            s_FIFO[5u].u2_Data[3u] = rxObj->word[3u];
            
            s_FIFO[5u].u2_DataUpDate = 1u;
            C1FIFOCON6Lbits.UINC = 1u; // Update the FIFO message pointer.
        }
#endif
    /*----------------------------------------------------------------------------*/
    /*【****】FIFO7受信*/
    /*----------------------------------------------------------------------------*/
#if ( ECAN1_FILTER6_ENABLE == ECAN1_FILTER_ENABLE)
        if (C1FIFOSTA7bits.TFNRFNIF == 1u)
        {
            rxObj = (CANFD_RX_MSGOBJ *)C1FIFOUA7L;
            s_FIFO[6u].u2_SID = rxObj->bF.id.SID ;
            s_FIFO[6u].u2_DLC = rxObj->bF.ctrl.DLC;
            s_FIFO[6u].u4_TimeStamp = rxObj->bF.timeStamp;
            
            s_FIFO[6u].u2_Data[0u] = rxObj->word[0u];
            s_FIFO[6u].u2_Data[1u] = rxObj->word[1u];
            s_FIFO[6u].u2_Data[2u] = rxObj->word[2u];
            s_FIFO[6u].u2_Data[3u] = rxObj->word[3u];
            
            s_FIFO[6u].u2_DataUpDate = 1u;
            C1FIFOCON7Lbits.UINC = 1u; // Update the FIFO message pointer.
        }  
#endif

}
#endif