/*----------------------------------------------------------------------------*/
/**
* @file		OPANP_Driver.c
* @brief	OPAMPモジュールに関するドライバ関数
* @date		24/07/16
* @details	
* @note		
*/
/*----------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------*/
/*インクルードファイル*/
/*----------------------------------------------------------------------------*/
#include <xc.h>
#include "BoardSupportPackage.h"
#include "init_fix.h"
#include "typedef.h"
#include "opamp_driver.h"
/*----------------------------------------------------------------------------*/
/*定数定義*/
/*----------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------*/
/*変数定義*/
/*----------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------*/
/*プロトタイプ宣言*/
/*----------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------*/
/*
* @fn           vdg_OPAMP_Set_Register(void)
* @brief        オペアンプレジスタを初期化します 
* @param        無し
* @return
* @detail		無し
 */ 
/*----------------------------------------------------------------------------*/
void vdg_OPAMP_Set_Register(void)
{
#if ( PMD_OPAMPMD == PMD_MODULE_ENABLE )	
    /*-----------------------------------------------------------------------*/
	/* AMP1CON1レジスタ */
	/*-----------------------------------------------------------------------*/
		AMP1CON1 = 0x00000000u;
		#ifdef DEF_BITNAME
			AMP1CON1bits.OMONEN = 0u;
			AMP1CON1bits.IMONEN = 0u;
			AMP1CON1bits.DIFFCON = 0u;
			AMP1CON1bits.UGE = 0u;
			AMP1CON1bits.HPEN = 0u;
			AMP1CON1bits.AMPEN = 0u;
		#endif 

	/*-----------------------------------------------------------------------*/
	/* AMP1CON2レジスタ */
	/*-----------------------------------------------------------------------*/
		AMP1CON2 = 0x00000000u;
		#ifdef DEF_BITNAME
			AMP1CON2bits.NOFFSETLP = 0u;
			AMP1CON2bits.POFFSETLP = 0u;
			AMP1CON2bits.NOFFSETHP = 0u;
			AMP1CON2bits.POFFSETHP = 0u;
		#endif 

	/*-----------------------------------------------------------------------*/
	/* AMP2CON1レジスタ */
	/*-----------------------------------------------------------------------*/
		AMP2CON1 = 0x00000000u;
		#ifdef DEF_BITNAME
			AMP2CON1bits.OMONEN = 0u;
			AMP2CON1bits.IMONEN = 0u;
			AMP2CON1bits.DIFFCON = 0u;
			AMP2CON1bits.UGE = 0u;
			AMP2CON1bits.HPEN = 0u;
			AMP2CON1bits.AMPEN = 0u;
		#endif 

	/*-----------------------------------------------------------------------*/
	/* AMP2CON2レジスタ */
	/*-----------------------------------------------------------------------*/
		AMP2CON2 = 0x00000000u;
		#ifdef DEF_BITNAME
			AMP2CON2bits.NOFFSETLP = 0u;
			AMP2CON2bits.POFFSETLP = 0u;
			AMP2CON2bits.NOFFSETHP = 0u;
			AMP2CON2bits.POFFSETHP = 0u;
		#endif 

	/*-----------------------------------------------------------------------*/
	/* AMP3CON1レジスタ */
	/*-----------------------------------------------------------------------*/
		AMP3CON1 = 0x00000000u;
		#ifdef DEF_BITNAME
			AMP3CON1bits.OMONEN = 0u;
			AMP3CON1bits.IMONEN = 0u;
			AMP3CON1bits.DIFFCON = 0u;
			AMP3CON1bits.UGE = 0u;
			AMP3CON1bits.HPEN = 0u;
			AMP3CON1bits.AMPEN = 0u;
		#endif 

	/*-----------------------------------------------------------------------*/
	/* AMP3CON2レジスタ */
	/*-----------------------------------------------------------------------*/
		AMP3CON2 = 0x00000000u;
		#ifdef DEF_BITNAME
			AMP3CON2bits.NOFFSETLP = 0u;
			AMP3CON2bits.POFFSETLP = 0u;
			AMP3CON2bits.NOFFSETHP = 0u;
			AMP3CON2bits.POFFSETHP = 0u;

		#endif
#endif
}
