/*----------------------------------------------------------------------------*/
/**
* @file		PMD_Driver.c
* @brief	Peripheral Module Disableに関するドライバ関数
* @date		24/07/16
* @details	
* @note		
*/
/*----------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------*/
/*インクルードファイル*/
/*----------------------------------------------------------------------------*/
#include <xc.h>
#include "BoardSupportPackage.h"
#include "init_fix.h"
#include "typedef.h"
#include "pmd_driver.h"
#include "pmd_user.h"
/*----------------------------------------------------------------------------*/
/*定数定義*/
/*----------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------*/
/*変数定義*/
/*----------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------*/
/*プロトタイプ宣言*/
/*----------------------------------------------------------------------------*/

/*----------------------------------------------------------------------------*/
/*
* @fn        vdg_PMD_Set_All_Register(void)
* @brief        PMDレジスタをセットします
* @param
* @return
* @detail 
*/
/*----------------------------------------------------------------------------*/
void vdg_PMD_Set_All_Register(void)
{
    /*----------------------------------------------------------------------------*/
    /* 周辺機能無効化レジスタ制御レジスタ */	
    /*----------------------------------------------------------------------------*/	

    /*----------------------------------------------------------------------------*/	
    /* 周辺機能無効化1レジスタ */	
    /*----------------------------------------------------------------------------*/	
        PMD1  = ( PMD_CCP1MD << 0u) |   /* CCP1モジュール無効化ビット */
                ( PMD_CCP2MD << 1u) |   /* CCP2モジュール無効化ビット */
                ( PMD_CCP3MD << 2u) |	/* CCP3モジュール無効化ビット */	
                ( PMD_CCP4MD << 3u) |	/* CCP4モジュール無効化ビット */
				( PMD_CCP5MD << 4u) |   /* CCP5モジュール無効化ビット */
                ( PMD_CCP6MD << 5u) |   /* CCP6モジュール無効化ビット */
                ( PMD_CCP7MD << 6u) |	/* CCP7モジュール無効化ビット */	
                ( PMD_CCP8MD << 7u) |	/* CCP8モジュール無効化ビット */
                ( PMD_T1MD << 11u) |	/* UART1モジュール無効化ビット */
                ( PMD_U1MD << 16u) |	/* UART1モジュール無効化ビット */	
                ( PMD_U2MD << 17u) |	/* UART2モジュール無効化ビット */
                ( PMD_U3MD << 18u) |	/* UART2モジュール無効化ビット */
                ( PMD_SPI1MD << 24u) |	/* SPI1モジュール無効化ビット */
				( PMD_SPI2MD << 25u) |	/* SPI2モジュール無効化ビット */
                ( PMD_SPI3MD << 26u);	/* SPI3モジュール無効化ビット */

    /*----------------------------------------------------------------------------*/	
    /* 周辺機能無効化2レジスタ */
    /*----------------------------------------------------------------------------*/			
        PMD2  = ( PMD_I2C1MD << 0u) |	/* I2C1モジュール無効化ビット */
                ( PMD_I2C2MD << 1u) |	/* I2C2モジュール無効化ビット */
                ( PMD_I2C3MD << 2u) |	/* I2C3モジュール無効化ビット */
                ( PMD_SENT1MD << 4u) |	/* SENT1モジュール無効化ビット */	
                ( PMD_SENT2MD << 5u) |	/* SENT2モジュール無効化ビット */
                ( PMD_DMAMD << 8u) |	/* DMAモジュール無効化ビット */
                ( PMD_DACMD << 16u) |	/* DACモジュール無効化ビット */
                ( PMD_CLC1MD << 24u) |	/* CLC1モジュール無効化ビット */
                ( PMD_CLC2MD << 25u) |	/* CLC2モジュール無効化ビット */
                ( PMD_CLC3MD << 26u) |	/* CLC3モジュール無効化ビット */
                ( PMD_CLC4MD << 27u);	/* CLC4モジュール無効化ビット */
    /*----------------------------------------------------------------------------*/	
    /* 周辺機能無効化3レジスタ */	
    /*----------------------------------------------------------------------------*/	
        PMD3 =  ( PMD_QEI1MD  << 0u) |   /* QEI1モジュール無効化ビット */
				( PMD_QEI2MD  << 1u) |   /* QEI2モジュール無効化ビット */
				( PMD_QEI3MD  << 2u) |   /* QEI3モジュール無効化ビット */
				( PMD_QEI4MD  << 3u) |   /* QEI4モジュール無効化ビット */
                ( PMD_BISS1MD << 4u) |	 /* BISS1モジュール無効化ビット */
                ( PMD_OPAMPMD << 8u) |	 /* OPAMPモジュール無効化ビット */
                ( PMD_ADC1MD << 16u) |	 /* ADC1モジュール無効化ビット */
                ( PMD_ADC2MD << 17u) |   /* ADC2モジュール無効化ビット */
                ( PMD_ADC3MD << 18u) |	 /* ADC3モジュール無効化ビット */
                ( PMD_ADC4MD << 19u) |   /* ADC4モジュール無効化ビット */
                ( PMD_ADC5MD << 20u) ;   /* ADC5モジュール無効化ビット */
    /*----------------------------------------------------------------------------*/	
    /* 周辺機能無効化4レジスタ */	
    /*----------------------------------------------------------------------------*/	
        PMD4 =  ( PMD_PTGMD << 0u) |	/* PTGモジュール無効化ビット */
                ( PMD_CRCMD << 1u) |	/* CRCモジュール無効化ビット */
                ( PMD_DMTMD << 2u) |	/* DMTモジュール無効化ビット */
                ( PMD_IOIM1MD << 6u) |	/* IOIM1モジュール無効化ビット */	
                ( PMD_IOIM2MD << 7u) |	/* IOIM2モジュール無効化ビット */
                ( PMD_IOIM3MD << 8u) |	/* IOIM3モジュール無効化ビット */
                ( PMD_IOIM4MD << 9u) |	/* IOIM4モジュール無効化ビット */
                ( PMD_PWMMD << 10u) |	/* PWMモジュール無効化ビット */
                ( PMD_CM1MD << 16u) |	/* CMP1モジュール無効化ビット */
                ( PMD_CM2MD << 17u) |	/* CMP2モジュール無効化ビット */
                ( PMD_CM3MD << 18u) |	/* CMP3モジュール無効化ビット */
                ( PMD_CM4MD << 19u);		/* CMP4モジュール無効化ビット */
}

