/*----------------------------------------------------------------------------*/
/*【FILE】REF出力に関するドライバ関数*/
/*----------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------*/
/*インクルードファイル*/
/*----------------------------------------------------------------------------*/
#include <xc.h>
#include "BoardSupportPackage.h"
#include "init_fix.h"
#include "typedef.h"
#include "refo_driver.h"
/*----------------------------------------------------------------------------*/
/*定数定義*/
/*----------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------*/
/*変数定義*/
/*----------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------*/
/*プロトタイプ宣言*/
/*----------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------*/
/*
* @fn        vdg_REFO_Set_Register(void) 
* @brief        リファレンス出力レジスタを初期化します 
* @param
* @return
* @detail 
 */
/*----------------------------------------------------------------------------*/
void vdg_REFO_Set_Register(void)
{
#if ( PMD_REFOMD == PMD_MODULE_ENABLE )
    /*----------------------------------------------------------------------------*/
    /* リファレンス出力制御レジスタLOW */
    /*----------------------------------------------------------------------------*/        
        REFOCONL	= 0x0000u;	
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            REFOCONLbits.ROSEL	= 0u;	/* リファレンスクロックソース選択ビット */
            REFOCONLbits.ROACTIVE = 0u;	/* リファレンスクロックステータスビット */
            REFOCONLbits.ROSWEN	= 0u;	/* リファレンスクロック変更中ステータスビット */
            REFOCONLbits.ROSLP	= 0u;	/* リファレンスクロックスリープモード停止ビット */
            REFOCONLbits.ROOUT	= 0u;	/* リファレンスクロック出力有効化ビット */
            REFOCONLbits.ROSIDL	= 0u;	/* リファレンスクロックアイドルモード停止ビット */
            REFOCONLbits.ROEN	= 0u;	/* リファレンスクロック有効化ビット */
#endif /* コード量削減 */
    /*----------------------------------------------------------------------------*/
    /* リファレンス出力制御レジスタHIGH */
    /*----------------------------------------------------------------------------*/        
        REFOCONH	= 0x0000u;	
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            REFOCONHbits.RODIV	= 0u;	/* リファレンスクロック分割ビット */
#endif /* コード量削減 */
    /*----------------------------------------------------------------------------*/
    /* リファレンス出力トリムレジスタHigh */
    /*----------------------------------------------------------------------------*/        
        REFOTRIML	= 0x0000u;	
#if 0   /*コード量削減の為、ビット毎のクリアを無効化にする*/
            REFOTRIMLbits.ROTRIM = 0u;	/* リファレンスクロックトリムビット */
#endif /* コード量削減 */
    /*----------------------------------------------------------------------------*/        
    /* リファレンス出力トリムレジスタLow */
    /*----------------------------------------------------------------------------*/     
#if (CORE_TYPE == CORE_SLAVE)	
        REFOTRIMH	= 0x0000u;	
#endif
#endif
}
