/*----------------------------------------------------------------------------*/
/**
* @file		Timer_Driver.c
* @brief	Timerモジュールに関するドライバ関数
* @date		24/07/16
* @details	
* @note		
*/
/*----------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------*/
/*インクルードファイル*/
/*----------------------------------------------------------------------------*/
#include <xc.h>
#include "BoardSupportPackage.h"
#include "init_fix.h"
#include "typedef.h"
#include "timer_driver.h"
#include "timer_user.h"
/*----------------------------------------------------------------------------*/
/*定数定義*/
/*----------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------*/
/*変数定義*/
/*----------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------*/
/*プロトタイプ宣言*/
/*----------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------*/
/*
* @fn        vdg_Timer1_Set_Register(void)
* @brief     Timer1のレジスタを初期化します
* @param
* @return
* @detail 
*/
/*----------------------------------------------------------------------------*/
void vdg_Timer1_Set_Register(void)
{
#if ( PMD_T1MD == PMD_MODULE_ENABLE ) 
	/*-----------------------------------------------------------------------*/
	/* T1CONレジスタ */
	/*-----------------------------------------------------------------------*/
		T1CON = ( TIMER1_USER_TCS << 1U ) |
				( TIMER1_USER_TSYNC << 2U ) |
				( TIMER1_USER_TCKPS << 4U ) |
				( TIMER1_USER_TGATE << 7U ) |
				( TIMER1_USER_TECS << 8U ) |
				( TIMER1_USER_TMWDIS << 12U ) |
				( TIMER1_USER_SIDL << 13U )  ;
		
		
		#ifdef DEF_BITNAME
			T1CONbits.TCS = 0u;
			T1CONbits.TSYNC = 0u;
			T1CONbits.TCKPS = 0u;
			T1CONbits.TGATE = 0u;
			T1CONbits.TECS = 0u;
			T1CONbits.PRWIP = 0u;
			T1CONbits.TMWIP = 0u;
			T1CONbits.TMWDIS = 0u;
			T1CONbits.SIDL = 0u;
			T1CONbits.ON = 0u;
			T1CONbits.TON = 0u;
		#endif 

	/*-----------------------------------------------------------------------*/
	/* TMR1レジスタ */
	/*-----------------------------------------------------------------------*/
		TMR1 = 0x00000000U;

	/*-----------------------------------------------------------------------*/
	/* PR1レジスタ */
	/*-----------------------------------------------------------------------*/
		PR1 = TIMER1_USER_PR;
		
		T1CONbits.TON = TIMER1_USER_ON;

#endif
}
/*----------------------------------------------------------------------------*/
/*
* @fn        vdg_Timer1_Set_Timer(void)
* @brief     Timer1のカウンタ値を設定します
* @param	u4a_Timer　カウンタ値
* @return
* @detail 
*/
/*----------------------------------------------------------------------------*/
void vdg_Timer1_Set_Timer(uint32_t u4a_Timer)
{
#if ( PMD_T1MD == PMD_MODULE_ENABLE ) 
	TMR1 = u4a_Timer;
#endif
}

/*----------------------------------------------------------------------------*/
/*
* @fn        vdg_Timer1_Start_Timer(void)
* @brief     Timer1の動作を開始します
* @param
* @return
* @detail 
*/
/*----------------------------------------------------------------------------*/
void vdg_Timer1_Start_Timer(void)
{
#if ( PMD_T1MD == PMD_MODULE_ENABLE ) 
	T1CONbits.TON = 1U;
#endif
}

/*----------------------------------------------------------------------------*/
/*
* @fn        vdg_Timer1_Stop_Timer(void)
* @brief     Timer1の動作を停止します
* @param
* @return
* @detail 
*/
/*----------------------------------------------------------------------------*/
void vdg_Timer1_Stop_Timer(void)
{
#if ( PMD_T1MD == PMD_MODULE_ENABLE ) 
	T1CONbits.TON = 0U;
#endif
}